{
    "Mr. Bean Takes Photos On The Plane | Funny Clip 1 Minute!": {
        "text": "good evening",
        "url": "https://www.youtube.com/watch?v=3y9-dqtqlZE"
    },
    "Free Climber Emily Harrington Talks About Alex Honnold": {
        "text": "The joe rogan experience this season it was a lot of it was some baby steps of like. Going back to that route and just placing a lot of gear so i felt super safe and then. You know climbing it in the same style that i was going to climb with alex i'm climbing it but still placing more gear and then. During my try this year actually. Hold alex because he was he's definitely on. More comfortable than almost anyone i know on el cap. Most people at least feel a little bit of intimidation and a little bit of fear like. You know there's a little bit of anxiety around it and he's just as so casual. That he was like that he's just like you know just run it out let go go all the way like. He's basically just wanted me to do it the same way that i was doing it. Before and i was like you know how it's going to be a little slower this time like i just i think i need that for. My head. And. So he felt like you should do with the same amount of yearly did before i just don't fall. You know by alex the one thing he always says he's just like i follow your heart was like okay. Family guy flower. It just so the audience knows alex told me that he did. A route once and on his way up. Realized he hadn't brought any chalk. So you got to borrow it. From someone else was strapped tropes he's free soloing no chalk bag. And then he left the bag at the top so they when they got to the top they could retrieve the bag. The situation. How do you not. Bring. Like if you lift weights. If you like chalk. It's like it's very important for me to. And i'm going back to like talking about heart rate like i bet i bet when he's in those types of situations like. He's so relaxed and his heart rate is so low and he's just. He's a different. I think he's truly unique. You know and i think. I i think that. He just has a different. Like even brain chemistry than then a lot of us in terms of like how he feels fear and how he can maintain that composure in a very dangerous situation. Well he's. Remarkably calm all the time she just seems always like on this one plane like 55 beats per minute that. And it's great climbing with him actually because it kind of rubs off on me a little bit like when i climb with alex i feel more confident i feel more capable i tend to climb better. Even though he kind of gives me s*** all the time for being nervous he's always like you're always nervous like your. You're always stressing out but it's actually when i'm with him i'm like you know what. I can chill out a little bit i can like. I can i can be on that wavelength a little bit more so that's part of the reason why i like climbing with him up there and why i chose him for the project. I guess when you're around people that are if you're doing a thing and you're around people that are excellent at that thing. Contagious or at least it inspirational. Do ya de practice practice things you want to be better at with people who are better than you. For sure. Episodes of the joe rogan experience are now free on spotify that's right there free from september 1st to december 1st going to be available everywhere but after december 1st they will only be available on spotify but they will be freak that includes the video the video also be there it'll also be free that's all around go download spotify. ",
        "url": "https://www.youtube.com/watch?v=Sv4jq8t-7us"
    },
    "Time Out With Tim #7 - Leveling Up w/ Deepak Sharma": {
        "text": "Young thug the big seem is leveling up and realizing your potential. that's something that's that's really important to me and then i think we only have one life so why not try to make the best of it but i have a lot of like a wide range of guess i just had the mayor on recently mayor of ottawa and that was interesting that you don't have kickboxers professional athletes like doctors and all kinds of different people like makeup artist gamers like i wanted to talk to everybody cuz i feel like everybody has a story to tell everybody has something that i can learn from so without without going too much into that i'm also i just recently launched my digital media agency on the founder and managing director of deep digital media here in ottowa so we do all kinds of like videos and media content and all that kind of stuff and i also hold down a nine-to-five job i work in federal government. Weird but i think the podcast has been one of the most powerful networking tools that i like i could have ever even imagined like i got into it just for the conversations and just to kind of document my journey if that makes sense like i got into it because i wanted to kind of you know somebody asked me when i'm 50 years old hey what were you doing when you're 24 go to youtube that. that's what i was doing and so those are kind of the selfish reasons why i started but then these conversations that i'm having with people are genuinely like i'm learning more than any university classroom my side and i'm learning more than any book i've read just threw these hour hour-and-a-half long dialogue like where you have someone complete undivided attention now this is a person that you don't theory you you're connected with the life like one of the reasons i wanted to do it to it's just because you can dig into years like 10 20 30 years. Into podcasting to make money but i realized that it's taking up a lot of my time and it's taking up a lot of my my energy and there's a lot of things that i have to do a lot of equipment that i have to purchase the editors have to pay things that like out-of-pocket i have to their expenses related to it to get it to where i want to but i recognize that i am not at any level no joe rogan i'm no like i'm not going to be able to command the kind of sponsorship and that i would need to sustain this kind of thing so you know short of getting a box of you know shity protein bars at my apartment i didn't really want to take on any sponsors at least not right now so i had to think how am i going to monetize to say how and how am i going to you know a bigger picture how am i going to actually start living the life that i really want to live. Because i don't think that a 925 is what i'm wired to do i'm not talking down on it it's not like there's anything wrong with working a job just for me i just don't think that i'm wired to thrive and in that kind of environment and so actively trying to escape that environment and for me it kind of clicked that you know i can help people create and manage produce their own podcast cuz i know how much work goes into it and i know all the pieces that need to move to actually make it happen and so it started out with that idea and just podcasting and just like you know i could help you don't people people like yourself people who are you no busy business owners people with personal brands all these kinds of things start managing grow their own podcast what i did not realize is that it's a way harder cell-to-cell somebody on a podcast. That doesn't already have one or hasn't already thought of having one and so i had to pivot i had to i had to like you know this covid-19 me a great opportunity to kind of you know really think about okay it will wear my going with this you know i have a few clients with podcast thing but this is not really all that scalable or this is not a this is not it this is not the only service that i can offer its it's just not urgent enough for business owners to put up their money because it did not directly tied increasing sales and it's more of a lead conversion to lift anything and so i thought about it if i could i could do way more than just podcast people need help with their social media people need help with their you know what their video content production you're creating all kinds of like all kinds of. Programs online workout programs online courses like now's the time when everyone is realizing that if they don't already they need an online presence and video content is probably one of the most rich forms of media out there and so i was actually approached by a guest that i had on who i've been trying to get to have a podcast for a long time tony greco and he he calls me up and he's like a man like you do videos right i'll be completely honest i did not do videos at this point right it's like i mean i have a video component of my podcast but i know a lot of people who do make videos and i do know a lot of people who have these skills so he's like i need you to help me make videos for the ottawa police service and these are workout videos and i need you to create a web presence and i need you to manage that whole thing and i'm like yeah of course i could do that and so got that contract and now it's kind of been snow. Environment but i completely understand cuz i'm kind of doing both right now when you're working in an environment where you just have that eight hours a day and you're getting paid, regardless this like there's no real is no real push there's no real life for me for example i've no problem putting 16 hours in 14 hours a day for my own business or for my own brand be super motivated in super like i don't even know hard-working people typically probably will say it's completely up to them how much they can do and how far it goes so that's that's really cool. I'm not the one making the workout programs for myself or or my brand or anything like i am like it's funny much of that because in this whole journey i've i've you know i went down that route as well to explore a personal training and i'm actually a registered personal trainer but i just it wasn't for me i got i could shout at somebody and make them work out and stuff and it's really easy for me to do cuz people tell me i'm a motivating guy but it just didn't sit right with me on my god i have a bigger purpose not talk but i am helping if you are personal trainer or gym owner will help you create all your video content and you know produce it distributed you know we have a web web guys on my team who can create a whole web presents for you and manage all that you know social media so that's the kind of the marketing side of it that's the promotion sides. The weekly podcast for fun right son i think you hit the nail on the head man i think a lot of people and that's kind of where i saw my opportunity is a lot of people like the idea of a podcast they see everyone and their mom starting a podcast now but they don't realize how much work and how much effort goes into that and like you said just equipment selection alone i have a lot of friends in the podcasting space who dislike me twiddle their thumbs and thought about it for like five six months i don't know the audio technica need to to do all the things that you know you and me might have decided to do in terms of getting that equipment and getting that stuff but you know you can start a podcast with your iphone if you quite frankly if. If it's a hobby and it's you don't you don't really see it as something that you know you want to become that next level production dude it's way important to just start and figure things out does he go then sit and think about it and read books about it and watched a million different youtube's about it and had that analysis paralysis i think it's really important to just get it get it this mike was a hundred bucks on amazon and it has the xlr input it's got the usb this is like $100 mike you can start a podcast with that you know i decide to get the rode boom arm because i like it not being in my face but it comes with the stand like it does not have to be as complicated as we like to make it but the time think that's something that you will not get away from it takes a lot of time to produce a podcast to put it out to promote it because you could put out the best podcasts and if people don't know about it. It's like it doesn't even exist yep completely agree and yeah i mean i'll say like when i started youtube for example like i was doing it on a 2013 macbook air with like the crunchy speakers and like no facecam and like you see my mouse come in the screen and stop the quicktime player so like you know you got to start somewhere in like that's what i say all the time to unlike you know just try it like i would rather produce 200 horrible youtube videos and learn and get better and every single one then read you know a hundred books on how to make the perfect youtube video and then make one right like that's the thing in the eighth school like you were saying at the beginning to to see your progress like i go back and i'm like i can actually watch myself growing up through like three or four years of content and be like wow like i'm so much more mature now like i'm so much more knowledgeable like oh i still had it back then but like i've improved so much it's a really cool thing and even like you want to take it really far to the extremes i got something you could genuinely show like your kids one day you can show your family if they look like you want to see what i was like when i was 16 go watch that you. Best computer that money could possibly buy got to build snowman that's all that all, if you do produce the content from your phone and this and that and you start to gain steam it starts to snowball and you're like you know what i think i'm going to buy that $500 rode mic or you know i think i'm going to invest in a couple thousand into a good soundboard and this and you know i see you have some soundproofing on your well that's not cheap you know i think i'm going to put some of that because it's going to creating so much of this content that might as well make it sound good so i know i'm not going to put words in your mouth but like you and me. i feel like we're the type of people like it when we decide we're going to do something with do it right so from the beginning i decided like you know i don't need joe rogan level set up what i need to have a couple 4k cameras i need to have good lighting i need to have the you know like luckily my apartment small enough that you know what the acoustics are. Be good in this room but things like 20 bucks felt that the pump filters this road i got on for 40 bucks than like my proper like $1,000 cameras and certain situations like is actually crazy like especially like this one like the new iphones like the new cameras they have like those are as good if not better than like really high quality equipment and like most people have that just in their pocket they could just literally pop them out and and film some and a great and and now there's so many options to write like you don't have to be a podcast so you don't have to be a vlogger you know how to be a youtuber you could literally right no articles on linkedin or you could go and like interact with people on the internet you don't even have to be like a real content producer you could still be involved in the community. And like i have a lot of people personally that followed me that are black well-known kind of in the community but they're not they don't produce any content it's just cuz they're still active in there like communicating and talking to people at such a cool thing because even like you and me who share a lot of similarities like we can just hop on a call like this and just chat like when has that ever been possible before like when would we have ever met without these kind of platforms and what's going on like i don't think so right so so your content for the sake of creating content because the cool thing to do actually have something that you want to talk about i actually have like something kind of like like that you believe in something that like you you're passionate about life deposit the topic of podcasting i could talk about it so openly passionately because i'm doing it i'm living it but if you were to talk to me. Python programming i don't know it's completely above my head i just be sitting here that i don't know about that stuff and it's not my lane this is not where i'm you're focused and do what thou not so that's not to say i want a i even want to like that's not i'm not it's not for me and i don't want to become an amateur i would never become expert i don't even want to become like know the basics of it because it just doesn't serve me then serve my audience so for me i would rather just be really good at the things i'm good at and just go in on that and so i could i like talking about the things that are i'm passionate about and there's an infinite amount of content i can create with that in mind yeah i think you said it really well i mean i would say i was just having some kind of mission or some kind of vision right being like. I learned is regardless if you don't you know like something about the video you made you don't like something about yourself like you just got to share it you just have to be yourself and put it out there because faking it is really not the way to go up specially doing kind of stuff that we're doing right so get started in podcasting cuz i know you when you came out what kind of inspired you and at the time seemed really cool and like i like traveling i like business this is great university environment and you know i got to travel on the international exchanged i was involved in a lot of club. A lot of different things i didn't take a lot away from the actual classroom environment you know if i could if i could go back i might i might have not even done that for four and a half years you know but hindsight's 20/20 and i came out the other side but all that to say once i graduated started working for the federal government i got a full-time contract kind of able to pay the bills and stuff and a big thing for me was being like moving out of my parents house i had to i had to get get away from my parents house and i did a whole video on this recently talking about why and it has nothing to do with not liking my parents or anything like that it was just you know about having the freedom to kind of pursue the things i want to do and figure out who i really am and what i want to do and so a year ago june back in like march. Marcher like april this idea that you know whenever i have conversations with people whenever i'm in a group setting and stuff like that i always tend to make the talks like kind of deep l is kind of like go off on kind of bigger picture tangents i always like to talk about kind of things that are like a little bit like complaining about the weather not small talk like not i always wanted to talk about like like like you know how do you feel about this very sensitive issue like i always find myself doing that with people and i have friends like mad you should like you to have a youtube show or you should like uh have a show like yu-gi-oh is like. Every time we're around you you just bring this out in the in people only man i don't know that sounds stupid like what do i got to say like i'm just a guy i like i have nothing important to say and enough of hearing that after a while like a podcast equipment and i first made the logo and you know the idea it's it's not that deep kind of came to me because it's kind of ironic because i do go deep and i do kind of go off on this deep change it so and it's obviously a part of my name as well and so i'm trying to let paint the timeline because it's really important that like i decided i'm going to start the podcast and around like february i got the logo made i got that but i had didn't put out my first episode. Until june of 2019 still hasn't even been a year yet if i'm being completely honest like as we're coming up on a year of me in this podcast in journey and so leading up to that buying all the equipment figuring things out i think i did a test episode with a buddy which was supposed to be the official first episode but he swore so much in the show that i literally like i looked at i looked at it after i was like i can't put this out man like she saying something like they can we can't i can't put this out of love you dog but this is this is not a good look for the first episode that your people's attention is going to be on the first episode so june 22nd of 2019 put the first episode of the official upset with my buddy and i look at that thing and i cringe bro i didn't even have my lighting yet unlike i have a so nervous i didn't even know how that like ask questions and have a flowy conversation. I was a mess but it was still a good conversation at that time i felt like i had to have like a beer i had to like drink something to kind of like he's my nerves like for the first few episodes if you look at them i'm not proud of this but like i got a i'm not used to being on camera it's a weird thing i'm going to do this just for the sake of documenting my journey and i've been through a lot of things in my life that i think could help people out as well and i think i have this ability to kind of connect with anybody i think this is something that i've kind of had to come to terms with myself cuz it's kind of a weird thing to admit but i feel like i could talk to anybody about anything like it's just something that i'm able to do you know even if i don't know about the topic i'll bring it out of you like tell me what you like you're interested in and stuff like that so. When i realized that okay i just have to hear what this person saying actually actively listen to it and respond it makes the whole game so much easier because now you're just having a conversation and you could prepare you could do some research you can have some bullet point questions you got ass but i'll be completely honest i don't prepare for my podcasts like i just go because to me that's how i can be completely authentically myself and when i do prepare for something that you know i'm a little bit more uncomfortable with i don't do a good job i've wanted back and i've looked at some of them and say that was horrible that felt scripted i was just talking about things that it's just not in my element like like if there's any advice i can give people just do the opposite of what i'm doing right now which is just rambling which. Intelligent people i think we could agree like people like elon musk or even you know our prime minister did it the other day people have their opinions on that huge paws right like that is something you hardly ever see but i think a lot of people do that like intentionally right cuz that actually shows that they're taking in what you said processing it thinking about it and then formulating a response they don't just already have something to say immediately because they've had they actually listen to what you were saying and i think that's that's kind of getting more rare which is unfortunate and a lot of people especially in my head when i talk to them like it's hard to have a conversation because they'll just the body and a lot of times with things that they've already drilled into their head in that they want to say in that point so 1000% fault it's how we've been kind of to get too deep here but it's almost we've never really been taught to actually listen to what somebody has to say. How do i treat everybody with that respect cuz it's it's a respect thing whether you whether subconscious or not it's like if i'm just butting in with and just trying to get in what i have to say it's it's almost a form of disrespect because it's like you are not even giving me the time of day to finish my thought and i've found myself even now and it might seem rude but this is just because i'm learning how how much how important it is to let people finish their thought it's like if someone does that to me if someone interrupts me when i'm in the middle of a point and i haven't even reached my point i'll be like you let me finish people fp it's met with like oh oh s*** like let me say it then respond and let's have a conversation like adults you're not a child. That's quite frankly something that you know and maybe you could talk about this because maybe you're you probably come across a lot of people who maybe don't do this a lot and you know i would i would prefer for this to be face-to-face because i can even get more body language and and feel more what you're saying but i think we're losing that a little bit even with all this technology that's keeping us so ever connected i think we're disconnecting from actual you know subtle schumann shoes that are very necessary yeah a hundred percent agree with that i can say like i'm working remotely right now and you know i've met a few of the people on the team in person and even just the fact that i met them that one time before makes such a difference in the level of connection i feel with them like the so for example i'm working a team of about 8 people those are kind of clothes people i talk to you and four of them i met on microsoft campus when i went to interview and i can save 100% like just immediately before we even started like i ought. Matically felt just like you know deeper connection like that i could talk to them over the people i've just seen on the webcam and it's nothing it just because you know you've had that connection you actually seem completely entirely what they look like from 360° you know you shook their hand you've seen like their mannerisms are some of the things they do with their body or the way they speak in like that is such a deep level of communication that like you said it's really hard to get on here and even with this facecam and like then you have like the lighting issues and angles and you're right like you just missed out on a lot of very important things and as much as it's still great to have these conversations are still super valuable and you can get a lot from the conversation in person to write is so much better but of course now that we're going to be losing a lot of that we relied on for so long with all this covid-19 6 feet apart in the work from home so so how do you what do you think about. Like i didn't go get beers with him after work right i got something i noticed a lot here in that is really unfortunate as like you kind of need almost a reason to like reach out to people now and talk to them like it it's you don't but it's harder to like just have those like personal connection moments where you have like 5 minutes to chat or you have like 10 minutes to talk about like your daughter or like what you're going to do after work or like the soccer game like you kind of have to schedule a meeting with a purpose and then if you go off that it's like right so that's that's what i miss fortunately for me there's like the you know we have like these hour-long blocks like once or twice a week where we kind of are allowed to do that but not the same as you know in a meeting or walking down the path with someone in talking right so that's kind of my opinion on it. 4 days a week i already worked at home so that that wasn't a big transition for me even though i'm i would fight i would consider myself a pretty extroverted person and i love i love those chats and i love that kinda think i just found that i could get my work done at home in such a more efficient way but i seek out all the other the physical the actual physical face-to-face connection outside of that but then i did find myself some of the work stuff so i'd like to go in on a friday and have that team breakfast and talk about something unrelated to work on those kinds of things that you do not to beat a dead horse but i think it's going to be really it's going to be really interesting and then kind of another impact of the whole work-from-home thing is you know people are very very excited about it but now you're competing with a billion other people worldwide for the same job so how excited are you for. And i don't know i like i think that's something that has to be considered as well because you know if if patel from india can do the same job as as you for a quarter of a price businesses are going to like i don't care if you think you're this amazing happy bubbly person that everybody likes businesses are going to hire patel because he could just do the same thing for you for cheaper it's just the reality so i don't know i think it's weird if you think about it like this like you know the 12:50 students benefit and like i honestly don't really see those kind of benefit packages going away or i see them being replaced by something else like in the future just because like what you said there was so much fun. Climate now in like when you just go from work from home and now you can hire anyone like the reality is a lot of the jobs that are you know those in person close jobs like are coming back or they going to come back in a lower capacity and i think that when we have a population that has what is it like 15 or 20% unemployment or what states is maybe a better example would have like 20% of their population unemployed you know that's like 60 million people like how do you support those people without jobs right and like the work-from-home thing is great but the reality is like they're actually is a somewhat of a barrier to entry to it like you have to have a computer you have a decent setup yet that first of all i would see a private room which i think a lot of people don't actually consider like if you're living in like maybe a poor neighborhood of you're not super affluent like you probably don't have like your own office or like you probably have like a crappy desk in your bedroom that like you use or something right like there's a lot of barriers that like we're going to have to hopefully figure out as we go through this so it's going to be interesting. I really do we're going to see some weird stuff going on to ubi things are really interesting discussion because you know like for society as a whole is this a net benefit because now people in theory now this is where the fiery part comes at the end theory now they can kind of now that their bills are taken care of now there's a you know now that the most basic necessities are are in theory taken care of by flat screens in iphone but you know if that's taking care of people who are getting these benefits can they now contribute to society in a different way through art through entertainment through poetry through anything that like you know they've always kind of wanted to pursue but because they're so busy working three jobs to pay the bills they couldn't do what time on the on the flip side of it you know. It doesn't make sense to have human beings doing some of these things especially the dangerous jobs and while we're not going to have enough and the idea that i'm not sure if you saw this thing it was a while back on twitter and they were like oh teach like coal miner's how to kotor teaches people how to code and get that's just not really a realistic thing like learning the basics of coding is a lot different than being able to jump into like a startup company or actually be employed in that industry so. It's it's it's very very privileged to say that it's it's crazy to watch everyday it's like well on this episode of 20/20 yourself from like anyway that is impacting you and you just look at in your like woah like this is actually happening like you just start talking about what's going on in your life if this was in a movie like this would be like block but like everyone must be crazy the recent riots in all combination with everything that's happened in the past 6 months do it yeah it's it's like i mean i guess it makes sense it's just spiraling out of control and like everything's breaking step by step by step but yeah it is crazy and i do like we're going to look back at this and literally be like damn like i was living during 20/20 one of the craziest years ever or. Knows maybe this is going to be mild compared to what happens in the future no i don't know if we could shut down because of a globally connected economy because of a virus are we thinking that there's never going to be a more deadly virus and more involved in more you know a virus that affects your people in our age group people infants children that kind of stuff imagine if ebola was you know the same as a coronavirus right now and i'm no expert on this stuff but it's like what what next how do we prevent something getting this out-of-control moving forward i don't know i wish i had the answers yeah and i mean even like and then you bring that up in like think about the recent like a spacecraft that tesla and ask like we could be living on mars in the next 25 years for all we know that people think that sounds ridiculous but then i think. Oh yeah that's the neuralink is a whole nother level i don't know enough about it but it's just like when i watch like the little demo video and like then i hear them talking but it's like such like you said such a casual conversation like that to me is him like not even giving us the optimistic view right like i think you on probably from his past like doesn't really tell you like the full potential or full capacity of what these things can do and it's like this is what he's openly speaking about we have no idea what's coming right and like that's that's crazy i don't even know what that is i don't even really understand the people working on it. So you're doing all we didn't get to talk and nothing at about you know kind of your work ethic and inspires me like you if your 19 right yeah you're 19 years old doing all these big things mandy you're going to be in these conversations the way people talk about elon musk's they're going to be talking about you one day man i genuinely believe it so just keep doing what you're doing and like i love i love what you're giving to the world that thank you and i appreciate that alright so that being said everyone that that has been this episode i hope you guys all enjoyed if you did make sure you leave a like subscribe and i'll see you again in another tech with tim podcast.",
        "url": "https://www.youtube.com/watch?v=gmfvUAd4ZJ8"
    },
    "Time Out With Tim #6 - The Future of Social Media w/ Gabe Feldman": {
        "text": "Hello everybody and welcome back to the episode of beat i'm out with tim podcast somebody really looking forward to this episode today i have on my friend gabe we actually went to highschool together we've known each other for a while but we haven't really been kind touch your talking that much was nice to going to reconnect gave thanks for joining me. But that after and i'm more of a creator so i think it'd be cool to have this conversation between kind of the business side in the creator side and how they interact and all that and what we're going to do in this episode just dive into some different social media things talk about his journey on all these different platforms and yeah i mean i'm looking forward to it so do you want to just walk us through what you do right now cuz i know you work at viral nation to be quite honest i don't know exactly what you do have read your title as a business leader or something like that i've seen some of the cool stuff and all the influencers and brandy work with but you wanted to walk me through like what what you actually do on a day-to-day basis. Do you know where we're implementing and and conceptualizing the right the right strategy especially for for audiences of today at least myself i don't do anything. Journey to say the least. Really close friend of mine started myself and him we started a talent from pretty-much represented influencers like salmon talent on social and concentrators to really help manage the business side so a lot of our methodology back then was let's let the traitors focus on what their grade out which is making a amazing content and then let us handle the business side of things. one of the largest island in the world. And now we're about a hundred twenty so i was there from a very early age myself as a person but also as the agency and now i'm here. I mean i'm sure we both could do with that i think everyone deals with a rat like the judge man in the hayden the idea of being different and unique right and i think like for me i didn't really get the freedom until i kind of hate grade 12 first-year where i was like you know i don't really care what everyone thinks like i like doing this it's huge let let's keep going if it's beneficial but back in grade 10 and 11 you know you're thinking about is like. Behind stuff like this in the work that we do has changed a lot but back then it was a tough place to be especially in a place like high school where like you know when your friends with both of us didn't really have that much of an idea what you did so that you kind of just just going to keep it to yourself within your circle is that kind of your way of just you know dealing sex i feel like a great time for me at least because you were starting even before that i guess i had a lot of difficulties for the youtube channel. Stop creating content and started focusing on the business side of things which was frankly just more lucrative for me as a person and should i think it was just like i didn't have fun making constant anymore. Found some socialite business consecrating at the time and then everything else that comes with you know doing that type of stuff in high school it was easy for me because frankly i didn't put any effort into school side of things which is what do i like doing and obviously those things are going to be what i excel at what i do best at what i want to put the hours in for and i said let's focus on that and i just didn't really study for exams really care about school still ended up doing fine really was able to put a lot more effort into the youtube channel even start this podcast everything else that i'm doing right now and i think that that's helped me a ton and i've obviously helped you as well as kind of picking what you want to focus on not necessarily neglecting something but it doesn't need to be the main focus right. The methodology of like you have to master your craft right so my goal is to do at least when i first thought i was like okay how do i become the best in the world. No i'm with you and i've had to i guess you've heard we've had a lot of conversations on this podcast about i'm coming to school system and i think you know this pandemic has brought out a lot as well right it's kind of showing people that hey we don't necessarily need these lecture hall of these classrooms is huge time commitment i know we can kind of learn it on her own and i i have a feeling that as we continue to move forward you know 20 20 20 30 we're going to see less and less people going that traditional route in this just so many new ways that are popping up to learn this and get that kind of education right you don't need to go crazy in debt and almost ruin your life before it even begins that's kind of the way i see it for a lot of people they just they jump in they don't they kind of go because of pressure they don't know what they're doing for my field and makes a lot of sense what i'm doing for a lot of field that makes sense but there's a lot of doesn't really make any sense to go to school for that at least until you've committed that that's really what you want to do. Frankly i think it's as the years continuing and i think he learning and online schools going to become more and more prevalent even after this pandemic i think it's going to go or not and i agree with you man like when i look it's like people you know in our face. Does not like everybody's different it depends what you want to do everything with it maybe the same ability or even just passion for a specific topic and they're they're still figuring things out right but that's why i take some time to figure things out right there's no harm in taking a semester off taking a few months and then just kind of tasting trying something done seeing what you really want to do because you know you don't really want to walk into a four-year contract we just kind of the way that i described it by going to university and if you back out you're going to lose that that whole investment essentially which now it is not as much an extremely expensive. It is hard the roi i can't see many situated what's going on and i think when you start posting on social media maybe you can talk to this, and viewing our stuff giving their opinion it's hard to come pick what's. Writing what's wrong and you have to have the self-awareness to know what i'm doing is right this is good i like this or i don't like this i'm not going to keep going and that's why i see a lot of you do mental health issues on social media to because people just they aren't really self aware they don't know what they like they don't know what they don't like and then someone comes along and starts telling them all of this these things and they don't know how to listen to right. We already been around for a while now you've been doing this for so long you been on all these platforms you start on youtube i know you got a decent presence on linkedin i see on instagram which one is your favorite just personal preference to sew. It is bacterial channel but i think further as we continue on over the next couple years we're going to see a massive shift in terms of your worship on youtube and friends. Yeah i got like seven hundred reactions $40,000 for the same reason that you said because i go on there and i'm actually learning something you can't really beat that you can but it's in the most people aren't that rude or offensive or trolling on linkedin cuz it's a professional platform that want to give some kind of inside i just find it a really valuable platform that i think a lot of people under value today and even just a job opportunities and everything i call go on their don't have job offers i can connect with people i can see what's happening you know what recruiters a great i really enjoy life and i've just started getting on it and you see and i posted some clips and stuff i'm starting to kind of get used to the linkedin feed but i think that could be one of the next big platforms for sure and if it already isn't right so. We also have to consider too is like the content discovery on linkedin is a 5-4 so when we think about you too there's a few ways on how new viewers can find your contact right they can see it as a recommended in the sidebar suggested above related videos that they're watching you could be on their homepage they can go ahead and actually search for what you're about. Kissing way where it has a higher propensity for larger viewership and that's why i think there's so much low-hanging fruit. Has more of a formality. a lot of people right that just have no the no profile photo they throw pillow resume and they have it there just to link and i'm like this is your online presence i almost am treating this is like the the facebook of our generation right. But linkedin you know you go on there and adding everyone use building this network of people in the great thing is if people don't realize you don't people post job postings on their they like looking for this person like it's really it's a great way to can i get to know people to like i've reached out to people on linkedin and i find that generally if i'm dming someone i have a higher response rate on there than i do on you know platform like twitter or instagram or something like that. They're looking for somebody to consume that's of value and that's what i always try to put out on my channel regardless of something that's valuable to something to watch when you come away and you say hey you know i learned something today or that was cooler i like the way that guy taught that whatever it is that's what i really like about linkedin cuz people are seeking out value and for a lot of people that's the type of content they're trying to post like i'm not really posting any kind of mindless content on my youtube channel it's there's no sure maybe this if you like coding and i'm curious to see where it goes the next few years because the worst thing. Freedom in the stuff you put out has to be tailored to who you want to watch. That's the people that want to learn programming that are maybe more beginner level they're getting into the text-based but at the beginning i think a lot of people just post everything and anything just to try to see what works which could be a good idea who you're working with who you're serving this content to so you can tailor it to them which i think a lot of people neglect. So when you get limitations and i think that that's also what happened on tik tok because you're not hosting hour-long content like you would on a platform like youtube. Topic in and of itself right looking at what is the difference between tick-tocking by because i think what's happening tim with buying the problem with the problem with. Well that's i mean that's is interesting that you said that because that's kind of what i've noticed is why me i'm the same like all gone ticked off once in awhile just going to see what's happening just to be in the space understand how this younger generation is taking it because from what i can tell if this is a very younger generation thing like yes there is no some older people on it but it seems like the kind of average demographic is in that is in a cup of orange group how you make money on tik tok i mean to make sense for me for the big influencers they can kind of push whatever they want other platforms would say i was a stalker that had like a million followers or something how am i generating revenue from that profit or maybe what is your strategy working with brands to push something out on tik tok then. In terms of how tiktoks giving back surgery or community it's not the big things tim. battery small things it's like them shouting out their creators and stem doing really cool meet up and form and acknowledging their looks. Nation that can help us connect with those influencers in building strategy on how we want to work with them. How do i transition my audience from tik tok over to a place like instagram over to a place like youtube where the propensity for monetization is much higher. Senior you can post immediately it has you do a hundred seventy thousand views or million views and it's just something stupid like some guy in a video in his face but i guess that makes a lot of sense cuz they have to to be sustainable they realize they can't just post your 5 tick tocks a day and do one brandy a week they have to move off and can i go to a platform that makes more sense so i almost see this as like an exposure piece almost like advertising themselves like and then like you are going to realize that my time is better spent over here on youtube on instagram because you know i can make my millions where i was on tik tok i'll do it now and then but it is not worth my time you think that's going to happen. I would say more friendly four ways that firstly they can get more money on the platform slide for example the reason why i say this is because the reason why brandon spend millions of dollars every single month on a place like instagram is the call-to-action one of the coolest ways were the easiest ways to drive audiences over to a landing page or to your website or to the app store or do your ecommerce is to the instagram story swipe up it's the most to drive people to places. They have to keep their nothing so i think a lot of it is in the hands of. Fast very quickly mindless piece of content i mean look at twitter the tweet limit look at tik tok the time limit vine right it seems like what's becoming successful nowadays it is is very quick grabs your attention immediately and only hold it for a few seconds is that is that what you're seeing as well as i feel like in the younger generation the attention spans just going down i mean i remember when i was younger you know i can sit and do things for hours and not get bored but right now it seems like people and i worked as a summer camp counselor and i worked in in that environment with children a lot and i just noticed that the attention span it is dropping so drastically do you think that could be partially to do because of platforms like this like tik tok like vine like the way that were moving online. Establish the consumer so inherently was going to happen by nature is with all this on-demand technology and and offerings and services that are super responsive easy to use a kid could what's going to happen ultimately is yes attention spans are going to drop significantly in the constant that people are consuming isn't going to be as long as they were what i will say though is that it's kind of like so even though some people are down to watch a 15-minute video they will watch a tik tok video for a minute long because not only is it easier to consume. How you're driving with uber retention right so how are you were changing your views and that's why i think it's so i think the reason why our place until combined sexy was because of those limitations but also because it just you on demand generation people are are there not waiting for anything anymore 90% of viewers or whatever it is. Uyuni curso creative in those few seconds there really grabbed my attention so that's a good point you know the 20-minute videos of those long-form videos unless it's something they really enjoy and they're passionate about and i see that a lot on on my channel as well like i have younger viewers but those beers are definitely exceptions but you know they're not the usual people like they're going out obviously is programming so it's different but they're kind of going out of their way to learn this they want to be one step ahead and they're watching the videos for that purpose not just entertainment to consume online. Moving online and just every day more and more people more people signing up more users as much as it were moving towards these fastform platforms there's also the people that really do appreciate the original stuff right of the stuff that's the longer-form and that's that's an issue of its own it might not be the majority but you know i'm not tending to the majority of people i'm tending to those people that want to learn that are kind of reaching out you know they went on youtube most of my traffic on youtube by the way is organic reach because the way i can ask you do it and i've planned my channel so they're they're searching for my videos they're finding them they're clicking on them not because there might be interesting to them but they're clicking on them because they want to learn right there's a different new gen pops up there's like the rebellious people from that area that still appreciate that original content and that the kind of miss it right. You'll subscribe and you'll watch the new videos and then i'll give you some other ones that maybe won't be those education once but that was kind of my model was i wanted to have all these these places all over the internet where you could find me and then it would kind of hook you in from there maybe you don't maybe don't subscribe that's fine but as you see more and more of them then you subscribe we build the base and then from there i can start posting content that doesn't just have to sit in the search tab that they can get recommended because i have a larger audience right so. What's the ability to sit there and grind when no one's watching you and learn and build those skills and get better and get better at making more engaging videos and just day-by-day improving until you get to the point where you know you're pretty good and obviously you're still improving but that's what happened to me i mean. Write 8 times union bike again goes back to the conversation mastering your craft and really only what you love right and i think that's like in a time like now it's so important to really really understand that and agreed like i think the biggest problem is that it can be expensive. How much faster on those platforms then something like youtube or youtube has a very exponential growth curve right at least from what i've realized obviously there's exceptions but at the beginning it's just you're putting in a ton of work you have no idea what you're really doing and you're not really being rewarded in any sense in fact you might be this reward you know you're putting in a ton of time maybe your mental health suffering whatever it is you getting those hate comments and it's really hard and rightfully so to struggle through that to get to the point where you start to see the increase when the exponential really starts to take off and that's that's the issue through making youtube videos. Learn and i know a lot of my followers have noted that that i've learned so much in the past two years and you can see that in my videos where the keys radio you're getting better and better and you're learning more things and you're sure no more knowledge and it just it is really fascinating and i like connecting with people not level 2 and i think you're right on youtube you build that kind of connection because you get to see them in the early stage when they're just starting out and then as they go up and up and up and they get better and better and better you're like yeah i've been with this guy i've grown with him you know it feels like almost like a threat right on the platform. Genuine connections and frankly that's why we've seen over the past couple years over the past five six years friends went from investing $0 into people like you tim to the scaling it to a billion dollar 5 billion dollar industry now so your audience has seen you as a person we're really stuck on the cable tv year they were stuck on the traditional forms of advertising and it wasn't until some of the larger players started moving over to social media arts started getting a bit bigger than they start to transition. So you see like arguing with coca-cola for example pepsi like these huge brands i don't know if you work with one's like that but what's the shift that you're that you're noticing over the years to social media are they favoring that or they just kind of doing a mix between the two. Are audiences and how do we go where our audience is already at right and that's why influence was so powerful for them but also because it's trackable how do i know if i if i paid 25 grand for 30 grand tomorrow for a billboard how am i ever going to track the consumer journey to the point where i can i can ask if you are alive back to that billboard impossible especially when you're running five different other marketing channels at the same time. Frankly they've already been doing this for a couple years now in from a level in like from your level is that. Just a branding play in my opinion that it is really no driving sales and i would say especially for smaller companies i'm not sure how many smaller brands you guys work with i think that's a big deal because they might not have the marketing budgets to do something like a huge billboard right they just want to kind of test out the product and i know like i've taken some brand deals that are like 50 bucks a hundred bucks when i was smaller for them you know that's a little experiment to get to try it out they get too cuz i don't think you can really do that in international marketing i mean i don't know how much a tv commercial cost to do but must be crazy amount but you can't you know you can't really afford to be experimenting with something like that. Or mobile game right what happens is yes some of my audience may say okay cool i want to download this game let me click the link in this description would otherwise also happens is that people can go into it like don't watch my video on their laptop and then with the game. Distribution team right to like it's kind of all-in-one right then because we have to think about this too is like i think a big misconception especially with brands that work and sleep in space is like yours is that we're going to use a guy like check with tim as our broadcaster we're going to use them as the guy that's going to drive traffic to our lander and drive sales right. Channel i start advertising mobile games right like okay i can do that but is that the connection that like art is my audience into that doesn't make sense to have that there yeah i think a lot of people make that mistake early on i know i did personally and i know we thought i'd talk with you about branding and stuff over length for a lot of people early on is trying to figure out how do i balance income and in my image right almost there on brand image and something that i realized very quickly is that it's not just about you know generating the money but it's how do i look at the end of day right how is my brand being affected by this in a long term which is a big deal in that i wish i had figured out earlier quite frankly. Remain authentic with your content in a very different space train him not to hate on you really easy so with the in. Something i would really encourage you if you're thinking of starting a youtube channel or monetizing to really be selective it's not worth the short-term gains of your 50 bucks a hundred bucks this image and potentially lose some long-term customers have been with you for a long time wanna become influencer the united states what do you think when you dream of being influencers are getting into that space like would you encourage someone is 50 and start a youtube channel. But like when you ask guys like us like if a fifteen-year-old comes up to me and says i like my number one goal is to be honest with you i think that's really cool. Just because of saturation and stuff like that. but imagine if it was even more it'll be just that hard to get noticed. Kids these days do not want to be doctors they don't want to be lawyers that's boring and it's cold. You know in 5 to 10 years do you see it being a normal thing cuz right now i'd say it's not many people you know run youtube channels or social media platforms very seriously do you see it being a normal thing for someone to hop that like you think it would be expected that you have no youtube channel you have a twitter you have all these platforms in your actively engaging the audience. Longer form content like youtube like facebook content like linkedin there has to be real motivation behind stuff like that because you're not supposed to do selfies on instagram you really have to put in time so i think that people are going to beat the propensity for growth in terms of influencer and like the supply of insulin. What is it. ",
        "url": "https://www.youtube.com/watch?v=RH6yEmcEjRY"
    },
    "Time Out With Tim #5 - Beau Carnes, Director of FreeCodeCamp YouTube Channel": {
        "text": "Hello everyone and welcome back to the episode of beat i'm out with tim podcast i'm really excited about this one i actually have bo from freecodecamp on both thanks for joining me i'm going to give you an opportunity to introduce yourself to the audience here and i work for freecodecamp.org a few things i think i do i run their youtube channel which has been doing really well lately we're almost up to 2 million subscribers and i also am currently doing a lot to work on the new python curriculum that we're going to be releasing right on earth on the freecodecamp.org so we have a whole interactive curriculum to learn web development and we're going to be adding a python section roy soon that's awesome yes i've known both for a while probably over a year now hasn't been that's got to be a subscriber. Can we start working together and i posted some content on the freecodecamp channel anyone that doesn't know what freecodecamp does kind of with the goal and some of the different aspects are do you want to maybe explain that to them just give kind of a high-level overview of what freecodecamp is we have an interactive learning curriculum so there's interactive coding challenges that you can do right in your browser and instructional content and it takes you all the way from knowing nothing to being a full stack developer so it focuses on javascript html css that you also learn us up on the back end with note. Mongodb and there's quite a it's very well once you go to the curriculum you'll have a pretty well-rounded education as far as being a full stack developer and it's at the great place for anybody to start that doesn't know anything about programming and like i said earlier where we're working on rolling out some new certifications the right now they're sick certifications pretty soon we're going to be increasing it to 10 certifications and we're going to be adding additional certifications that focus on teaching python and so keep an eye out for that because that's going to be rolling up pretty soon and i've been helping out a lot with that we also have our youtube channel and i am the one responsible for running the youtube channel and on that channel we post full courses about a variety of technical topics like what we have course on python javascript ruby c c sharp. What does robot youtube channel is and then how you kind of went was that after you start with freecodecamp or was that beforehand youtube channel called robot family and actually i started after i was involved with freecodecamp so do you want me to first talk about the robot challenge you when we first talked about how he got involved with the free cocaine yesterday i think i confuse myself there cuz i thought the robot channel was before freecodecamp but now that i'm remembering back cuz we've talked before i think you said something and correct me if i'm wrong but you had a personal youtube channel where you worry no posting technical courses and then i guess who is a quincy must have approached you and then you got into freecodecamp so is that the correct storyline in the midwest. Small javascript tutorials publish one tutorial a day and they'll just be like 3-minute tutorials and i would try to wake up and get the tutorial done like really early in the morning before the rest of my family that woke up it with my kids and stuff so and it it's supposed to toriel's and events and i'd already gone through part of the free code camp creek kill myself but i hadn't i wasn't contributing anything to freecodecamp i just learned a lot by going through the curriculum and i i posted about my vs nuggets youtube channel in the freecodecamp forum and in quincy who who started freecodecamp and runs it saw that post and reached out to me about interviewing me about my youtube channel on the. And this was back when the freecodecamp channel only had about seventy thousand subscribers so is a lot smaller than it is now and at the end of that conversation this interview that was for the freecodecamp channel quincy asked if i want to start if i'll be interested in posting some of my javascript tutorials on freecodecamp channel and at that point i think my channel is only like two thousand subscribers and i saw this freecodecamp sound seventy thousand subscribers so i figured i just completely abandoned my my personal channel and started only posting on the freecodecamp channel and i started quickly became one of the main contributors to the freecodecamp channel it to the point where i kind of took over the channel and this is all of the volunteer i was just doing this as a volunteer now i started running to the free cocaine channel to volunteer and i got more more more. Water freecodecamp community until quincy asked if if i want to come on full-time and i said yes so yeah so it proved up to eight employees with freecodecamp and pretty much every employee started out as a contributor and just volunteering time to help help build up the community before being hired on full-time and that that's exactly what i did so i did have i had two other software development jobs before i switched over to freecodecamp but it's been the other jobs that they were just that i knew that they they were just stepping stones to get to the position i really wanted and then when i got this offer i knew that this working for freecodecamp was was the the job that i would was was i really wanted. And so i continue to to work with freecodecamp in just continue to help help wherever i can to build up the community that amazes me is the fact that it is you don't you guys don't try to really generate a profit right you're just there for the community obviously you need to pay yourself and run the business but there's no ads like even on these massive technical courses you would think anyone else would just run ads because why not but it's because of this build such a strong community of developers it really amazes me and like i remember when you guys first show me the channel probably last year you're at just maybe about a million or you just hit a million subscribers and now you're almost at 2 or just passed to and the community around freecodecamp just seems so strong like even the forum i've met a ton of creators just by looking at freecodecamp and singing oh wow you know like both feature this guy when we reach out to him and see if we can do something and you guys really also have helped me i mean i honestly can say that my channel probably would not. At the same level it is today without freecodecamp because you guys reach out to you know high-quality creators that might not have as much i don't want to say clout but maybe you know maybe that's the right word to use it on the platform it and you showcase them and you tell other people you know it's not just about freecodecamp it's about learning coding and showing all these other channels so that's one and one of them is to bring awareness to really good instructors and we hope that people can't see cds great instructors on the free code camp channel and then go and then hopefully check out there other are there other content they have a lot of people whose course we post have their own youtube channel and i've heard from quite a few people have said that that's that it's led to a lot of. Yeah so so that's kind of the reason why i started this robot family channel first i was already kind of experience with youtube running the freecodecamp channel and i wanted to branch out and can't do something on my own for the freecodecamp channel i have a lot of control over it but i mean i mean it's still part of this organization or other input to what was going on on this channel and i decided i wanted to do something completely on my own so one of the really like two main goals for this robot family channel which was to have something fun to do with my kids because i make these videos with my kids and then i also had the goal of eventually getting robots donated to our family so i want to get free robot forever for my kids that people at that what it comes with donate to so we can feature on a champ and i would say we've had success on. Call frank's it has been a fun thing to do with the kids and we've gotten quite a few robots donated so it started out with just some robot toys that we already had that we made videos about and eventually i started reaching out to two companies to ask if they would donate robots toys to feature on her channel and a lot of them said yes and now we're at the point where we're getting companies just reaching out to us about different things that feature on the shamu died and it's generally like a fun scripted videos where the robots are characters and the robots are interacting with each other and the lap times my kids will be will be part of the video and like it'll be my kids we talking to the robots and it's been it's been really fun and it's one thing that i was expecting with is that word starting to actually make some money off the channel to so now we're getting. It's a work kind of more of a toward the younger audience you know cuz if he took my kids so it's more like a kids channel so i don't think i don't think kids channels get paid as much as like technology channels i'm sure i'll check with tim is probably getting more money. but also starting to be able to when companies reach out to us about featuring their product at work i'm at the level where i can ask for money in addition to the three products do we get the free product and additional money to feature their product on her channel and it's been really fun yeah that's awesome that's that's great to hear i mean that's such a cool thing too cuz your kids are involved in that and you guys are growing it together so that's that's great to hear getting into creating videos completely on his own. Help him a little bit but i heard i had an old camera lying around that i see his camera so he's been inspired to start treating his own videos and i've been able to even help him do some editing and stuff like that so it's been a kind of good learning experience for him to that's a great skill to have regardless if he's going to continue on youtube or not to start getting more fluent with technology and you do editing and having something to do so that's awesome i know you mentioned that you had some software development jobs for someone to get what your experience with programming is so like you have a degree or you you know are you a teacher what what what is your professional experience maybe. Something new so i completed online degree so i did do it i did get a a degree in software development but it was doing online school called western governors university and they allow you to work at your own pace and i was just really ready to be done teaching so so i was highly motivated to get this degree as quick as possible so i just so i did the whole degree in 6 months so it's so motivated your own pace and as soon as you do everything you need to do for the class you get to pass the class and go to the next class so it's not you don't have to take a whole semester off to class so. Last semester teaching i just started i like looking for software job so you can make a transition to right when the teaching year ended and and it really worked out so i actually use a strategy that i heard about love just when i went to get my first offer job i i called emailed a lot of software developers in the city that i wanted to work in which happen to not be the city i was living in we1 do i live in michigan and we lived on the east side of the state at the time but i knew that i want to move to the west side of the state to be close to family so i called email a bunch of software developers in the city we want to live in and just ask them if i if we could have coffee together and i told her i was just want to ask some questions about the industry and so then i would plan day trips over to the other to the city which is grand rapids and i would just have like meeting. Answer but obviously it worked for you i would definitely recommend that one thing also helped me was so i wasn't just trying to hopefully get a job at these peoples companies it was also i want to learn more about the industry in that area because just cuz i like a certain program language or framework is really popular in silicon valley doesn't mean it's going to be popular everywhere like regions have different program language is an instax that are more popular for that region so that's why i was able to like meeting with people i got to know like which was technologies were common at these companies in this area so a lot of a lot of people ask what should i wear for this framework and i think some of it depends on what companies use and. It makes it even easier you don't need to drive three hours to actually meet someone in person you could cold dm them on linkedin and you don't have a little chat there i know personally against tons of messages on linkedin all the time and if i see something that makes sense for someone really put some thought into it i'm always open to answering those in chatting with people so that's kind of late february early march. Sing like you know 8090 thousand some days i hit a hundred thousand and i can't help but think you know what to do to this this pandemic have you seen that as well on the freecodecamp like 50% to 100% more views per day i think overall it may be closer to 50% but some days we get like two times more views as we were getting before and i think we've seen a similar thing just on throughout all of freecodecamp you like and so i think that people are using this time to talk to a lot of people trying to take advantage of this time where there's not a lot of other things to do to improve their skills and as possible i mean it's hard to know the reasons that everyone has buy me some people probably hit have lost their jobs because of this and are looking to get asked. They're all home from school and i thought i could do a lot more helping with the kids and so it's it's been the worst for my productivity yeah i would imagine i think a lot of people would probably say that as well regardless if they have more time their productivity would likely be decreasing mean for me i know personally i work better you know a loan kind of isolated without any distraction and even just being back at home right it's so easy to yell go upstairs and talk to your family. that's a bad thing or like you know how people bugging you or whatever it is so that's what interesting to consider so i guess none of your kids like they're all at home is your wife at home or is it just you that's dealing with that. Time to get back to normal yeah for sure it's ice so i guess that's what you know we're on this thing of education people learning more developing your skills i want to ask you i guess you probably have a good perspective cuz you were high school teacher and you did i guess the free code camp curriculum in this online course and stuff would you say that freecodecamp is meant to be a substitute for a formal education or more of something that's on top of that something else that you can do a lot of the people that are using freecodecamp are people that are passed the job but i think you could also use it i think you could almost use it in replace replacing college i mean. When i got my first offer job most of the skills on that job where stuff i learned independently of my of this degree and then also i think the reason i got the job was mainly cuz of all the extra things i did i mean development degree but i think the things that make me make made me stand apart we're more that you to the sizing on youtube this manning course and then i'll side of berripop i wrote an article that got published on the freecodecamp news publication all about the strategy strategies i used to complete this degree in 6 months and it was interviewing a super popular article and like i think that just having the article about how is able to do the degree in 6 months was even more helpful than the actual degree when it came to getting a job as funny that's funny i mean i agree with you that like the reason i was able to get all the intern. You know they are as difficult as people say they are but really excited i'm happy that still remote cuz there was a time where i was pretty concerned that it was going to be canceled because some of the emails are getting or not you know the most positive things in the world didn't want to instill any false hope but it's good to hear that's going to be waiting to see how that's actually going to operate and work. I want to do that when i'm you know 25 do i want to keep doing this. i want to run something else so it's gonna be interesting to see what happens in the future and what opportunities with the future of education looks like there for me personally when i look at this pandemic what i've seen what was going to happen online education more people learning independently online at home i was kind of imagining that was going to happen anyways in the future at some point and i feel like the suspect that up would you agree with that as anything else you think that as a teacher i guess that's change and you have a perfect. I think it's going to speed it up baby now that pretty much all colleges and universities are happy having to do all online classes so a lot of the colleges universities that weren't planning on it i have to do it now and even high schools are doing online classes leaving my son's elementary school is trying to do online classes but there's only so much i can imagine we're not getting a lot of valuable content from his second grade teacher while we're at home but there's one thing that i think has to take into account is there's a lot of people making a lot of money on the way things were. Unfortunate but i think what this is done at least for me is kind of expose the fact that that that's happening right that we don't need your 50 grand a year 10 grand a year depending on where you live united states canada to get this kind of education i mean these platforms like freecodecamp is amazing courses i mean i have education stuff i put online and from what i've heard in maybe you have the same perspective a lot of people would say that some of these online resources are way more valuable than anything you get in class whether it's the quality of teaching i do personally like i pay a lot of i don't personally pay my parents back i'll be clear but that for university and i feel as though a lot of my professors are not adequate teachers i'm sure they're very smart they definitely know what they're talking about when it comes to actually teaching that to someone else i noticed a lot of times that they don't have that skills are some of them hardly even speak english and that's not to be racist or anything like that it just it is very difficult as a student to sit in the classroom and listen to someone for 2 hours that doesn't have the skill to actually teach you something effectively whereas. Online you know if you don't like something you eat composite video you can rewind you can really understand some and i think that is what we're going to move forward in the future but it's hard for professors at university really compete with without their online because like for instance a wee wee one course we have on the freecodecamp youtube channel is called python for everyone and it was created by someone can have noted his business he's known as dr. chuck and he's he's a professor at the university of michigan which is the top level school so if this is like a like a super well respected professor at a top of a school teaching python and it's it's this is like a i think it's a 12-hour course that you can you can learn online either free there's free courses from the top instructors on the in the world on most topics a tons of tons of top. Universities have released videos of courses online and id so it's it's really at like just your average professor at a university can't really match the the teaching skill as they like the top teacher in the world that's able to publish their course online that they just have to record it one time then people can continue watching it over and over again so that the route the the main benefit of the i think that there is the main benefit of a in-person in-person courses are like interacting face-to-face you can kind of asked questions quicker but now you can even it's becoming more common to build ask questions online like you still i mean networking is very important so when you go to a university gives you a chance to really meet other the other students meet the staff and that can lead the opportunities in the future so i think one thing. Because you know it's not that i didn't want to learn them i probably wouldn't even know to have to go do that right and the socialization is a great thing to you know some of my best friends i met in the university campuses people that i'll know for lifetime that i met on campus that really you know changed my life and you can't get that if you just you're sitting in your basement coating the entire time and do that but it is a level of initiative that you have to take upon yourself that i don't think everyone does right so that otherwise would have already happened without you haven't really. On this topic is if you were say like an elementary students are high school students today and you knew you wanted to be a software engineer software developer what path you think you would take you to knowing what you know now having experiences going through and seeing some like i'm sure you've seen millions of students in heard their stories what would you decide to do to go to university to bootcamp would you do the free code camp is mowed your papi maybe two years before i start a university course just to see what i can learn on my own and what can develop a mile and then after the two years if i felt like i was really. A lot of people don't you go to college right away and then never use that degree is very common for people good degree never use it and even for me my first degree is actually in video production and i use that degree for maybe a year-and-a-half for like two years max before i decide i want to switch over to teaching so wow that's why i make sense you make a lot of videos so maybe i'll tell him and now i'm able to combine all those things into creating software instructional content that is like the perfect combination you can possibly have for for what you did and that's why i see a lot of beginners making mistakes and program at 1 to ask you what do you think. Roma sneakers you see from someone who's just starting to learn coding zone is getting into the field that you know they want to be a software developer they want to make games whatever it is what is it what's some fundamental mistakes that you see from those people is trying to learn too much stuff at the same time so there's so many different programming languages out there so many different frameworks so many different id he's and and ways to do software development and there's so many different ideas on which is the best to use or which is the best do like that this is the best present i was this the best friend so when you're when you're brand-new jumping from one thing to the other like there's one thing but then i think it's best to just find one thing and stick to it like one programming language stick to it. Call you till you know it completely before you try to go on to learn another programming language and that is actually one of the benefits to the curriculum on freecodecamp.org is is it has a one a single learning path where it were you just start the beginning and you go through all the challenges till you get to the end and it kind of helps helps keep you focused so you don't get spread out like trying to go to learn different things so if you just so that's what i would say just stay focused. you don't have to learn every single thing all at once experienced developers never learn everything and you just have to pick a few things to really get good at yeah that's a really good point i knew what i always say is the more you learn the more you realize how much you don't know i mean personally like i think would happen to the lot of people in the internet especially as you know you get. Was younger but i really dialed-in on python and start learning that so what's your take on that then do you think it's important to try different things or is it okay to just kind of pick one thing and dial-in like you said before learning development is i just listen to a bunch of software podcast so that i just found lots of different podcast related topics and just listening to the people talk about different things and a lot of things i didn't even know what they were but through enough exposure to these different concepts i started to kind of get a good feel for for a kind of the layout of of the software industry and in all the different things are out there so i do think that i think there's some. You know you can make 3d games at home with a platform like that so yeah i think that's a good point i mean we both have kind of platforms were putting out content for free what do you think of a platform like udemy i know people that you know send x have you heard of that channel is on there so i was curious like what's your opinion of a platform like you to me a lot of the top courses on udemy we have free courses on the freecodecamp chan on that same topic so there's a lot of free content out there that that is actually high quality content that could be. Good as some some paid content and also so one so i tried to get courses for difficult campground from a lot of different sources than the one thing i've done is is as check the weight i've checked the free courses on udemy and i thought well huber posting of course for free on udemy there probably will be interested in sharing that with the free code camp seattle but a lot of the freikorps done there are not up to the quality of the place like you to me is that anybody can post anything and there's nobody determine the quality i mean sometimes you can tell just based on the reviews and stuff but there's a lot of shady things keep going on like i know i think centex he was saying that people were taking his his series i think maybe from youtube and we put on the monitor. The company of the whole doesn't seem to be that concerned about plagiarism because they still get money either way so i don't think i don't think it's the best company but i think like i'm not going to say that you should never never get a course on udemy cuz i think some of the individual creators that are putting courses on their they're actually really good people they're really good they can make really good courses so just cuz the company itself test shady business practices that the the creator's aren't necessarily don't initially have shady business practices and there's definitely a lot of good craters posting course down there i would say use first see what's available for free before you before you go to to pay for something and and just keep in mind that some of the free stuff on udemy isn't really that isn't really that good material of material yeah. I also know like i'm not a fan of it companies that do stuff like posted course for $300 and then put on sale for like 8 bucks like that to me is just a little bit misleading sometimes so i'm not a huge fan of you but i do agree with you i think i know i personally know people that post courses on udemy that i've had great success that young people love their course it's it's paid if they love it it's great but then same thing you don't there's no reason for all i know there's courses of mine that are on you to me right now that people are just dropping off of and i know send text with saying that it's very difficult it with plagiarism across borders right cuz i think i think he's an indian company i don't know but i'm pretty sure he said that for him to be able to even mark a corset plagiarize he first has to purchase the course and then he has to fly giddy as to send all these requests in fb creator of that course lives in a different country his chances of getting any of the money that they've sold his horses for his is pretty much zero right that's kind of the issue with the plagiarism and stuff online is it is really difficult. Prophet there in it to help them get a job or just share their knowledge people do actually have good intentions believe it or not so so yeah that's possible where do you see this channel and you know 5-10 years what is there any big plans anything you guys are thinking about doing that you want to share with us what we need to go to you to me because you can get for free right on the freecodecamp youtube channel so we want to just continue to expand with more more content or more in-depth courses on every topic on the youtube channel i suppose. People be like other people making courses may not like that but the truth is one thing we recommend is that you need to learn from multiple sources just cuz just cuz we have something on the freecodecamp channel that they're really good course doesn't mean you shouldn't also watch this course on this other channel or also watch this course maybe a udemy course because to really understand a concept is it's really good to get multiple perspectives on certain concepts in and hear people cuz every every instructor explains a slightly different way and that connects ended are there instructional style will connect with different people so one one person trying to learn would learn best from one instructor another person may want best from another instructor so hopefully people don't look at freecodecamp as competitors were just all trying to provide great content and. It just because our channel has a course doesn't mean it's makes us a year courses i'm going to get of you cuz hopefully people be trying to watch bothcourses you know where all the all the courses to learn as much as possible and as far as the freecodecamp organization with the other things that freecodecamp is doing one thing we just start anew with the youtube channel also is doing summits so we just on just on may 1st we had her head had a head of summit on the youtube channel where some of the pico camp staff including me and quincy and some other people shared about upcoming features on freecodecamp and we talked about the youtube channel we talked about freaking freaking freecodecamp news the forum and then also we talked a lot about the upcoming python curriculum and so if you want to know about freecodecamp what's going to what's going on with coming up just keep a lookout for the. It's that we want to start doing them every month to keep people updated of what we're doing in the for the community and so but the biggest upcoming thing really is the python certifications were adding to the curriculum by the end of may we should have that the beta test the beta test sign up for people to start going through the the initial python certifications so keep an eye out for that yeah that's awesome i think the python things going to be a big head i mean it's kind of the next big upcoming language here you guys see yourself doing anything with other languages like you see my videos and stuff like that do you think you're going to keep it english or do you see a possibility of freecodecamp branching out to other languages in the future like god you know speaking languages. Subtitles in different languages for the video so some videos have subtitles in other languages that people from the community have have created so we appreciate that and then for our head for the time being we're not looking at creating a youtube channel with the different spoken language but that's something that we would be open to in the future and for the freecodecamp.org on the creek ulam we are looking at translating into other languages and one that that's we already have almost complete is a chinese version chinese version of freecodecamp and we have at one of our staff members actually is from china and lives in china and it's kind of heading that up and getting that the chinese version of freecodecamp going and we are eventually going to have freecodecamp in like the top five. World languages or maybe it's the top 7 i can't stop my head now but yeah we do want to make this make free coding education as available as widely as possible to everyone all over the world that's amazing all right but i think we're going to wrap it up here thank you so much for coming on the podcast i definitely learned a lot about freecodecamp and kind of your background which is really cool to hear i hopefully we can do this again in the future and maybe we'll have a quincy on as well.",
        "url": "https://www.youtube.com/watch?v=Up6ZqWTAU50"
    },
    "The Mindset of an Entrepreneur with Clément Mihailescu": {
        "text": "That movie you and remember has sparked something in me where is like where i think this might be something i'm interested in and then ever since then i tried doing a bunch of stuff a bunch of entrepreneurial endeavors a lot of them were things related to youtube to you no online presence i tried streaming on twitch and i had a little bit of success there i tried a bunch of youtube channels no success at all there i try to see you like a business ideas but i didn't have the coding skills whatsoever. Really sparked mine in this might be a funny story for some people was actually a minecraft server so i don't trip you ever play minecraft videos are you a gamer. i used to play a lot in minecraft probably in elementary school and i know you get special perks on the server so you can like fly around like that extra items whatever it might be and i made my plug-in stuff like that actually has a month. The how much money i'm able to generate and not just for me was with spark that stuff and how i got into youtube and all of that so it's cool to hear that story cuz you're running out once in awhile someone to ask you what's the most important thing or like some of the big things you've learned since being a ceo maybe in like a management sense or just in terms of like running a business like some big challenges that you faced in and things you've learned along the way. These days has the idea isn't really what matters it's more how you're going to execute on it that is incredibly incredibly incredibly true and accurate execution is so important like we wouldn't be where we are today without no expert had we not executed like crazy and grinded like crazy and of course. One thing to have the idea but what you going to do with just that right you said unsexy work example. On this particular thing just giving you almost nothing but then you put that in the aggregate and overtime and then you're like okay wait a second you got a huge return-on-investment here in an incredible business or whatever you want to call it brand i mean i'm i'm with you on that i think the biggest thing i realized was how much work has to go it in without seeing any results and how dedicated you have to be to what it is you want to do like for me i was making $0 on youtube the first like a year-and-a-half that i was doing it not many people are capable of just sitting there and grinding and working their ass off with see nothing scene literally nothing in return seem like a few subscribers a few comments like those little bits of motivation is not enough to keep a lot of people going and that's what i tell people might look you want to make it on a platform like youtuber like even just anything i feel like you're going to have to be willing to put in a significant amount of work and i think to be able to do that you have to be so. Passionate about what you're doing which is what let me do that there's no way i'd be here today if i didn't really like coding cuz when i was making those videos you know i enjoyed teaching it i was learning new stuff but i worked so hard for so long with nothing like nothing to show for it and then all of a sudden it came and then it's exponentially grows and grows and grows i mean i can tell you a year ago i was making like a few hundred bucks off this right it wasn't like a big deal wasn't something i was doing for money was cuz i really like doing i was passionate about it and it turned into almost almost turned into like a proper business show for all those hours and hours of work that went in at the beginning with with pretty much no results right. Wanting the result really badly and if you want the results really badly you're going to be willing to put the work even if you're not necessarily passionate about it as an example i am not particularly passionate about my youtube videos. Play the part by far to do them because if you want that results you know what you're willing to put that work in. ",
        "url": "https://www.youtube.com/watch?v=cPcKO9SrIVQ"
    },
    "Time Out With Tim #4 - Clément Mihailescu, 25 Year-Old CEO of AlgoExpert": {
        "text": "Hello everyone and welcome back to the episode of time out with sim i'm really excited about this episode actually on my friend clements on here has a youtube channel you guys have probably seen him on the space before clement thanks again the podcast man appreciate it thanks for having me what you do get into the podcast. Started by diving into your journey learning to code so i know that you had a really unconventional kind of way like you're a math major i've heard that some of the things but i want to understand how you got into coding like what drove you to it and yeah why'd you really starting to that cuz i don't think that was something you considered doing in high school or even university was it. But after college though i realized everything that i want to do in life seems to point to coding everything that i want to do in life seems to have she seems to be much more accessible if i know how to code and so i thought to myself maybe i really should have put aside. On the one hand they are training you to go from no coding experience to employable as a full stack developer is in full stack is the key here they teach you both the front end and the back end and then to your to your question about you no experience. The two big hubs are still new york and san francisco or the bay area that makes sense that math right what's your do you want to just tell it like what was your degree again just so everyone knows that logical brain already you know how to tackle problems i mean i feel like i know the answer but would you say that was a massive advantage to you and maybe some math background going into a boot camp. Switch i know some people are either surprised by or some people almost refused to accept that they always say like know that must have helped a ton the thing is the reason i don't think it helps that much is because first of all i didn't think back to the clement of junior year in college. Looking at ideas and problems and all that yeah exactly and i would i would give you another example here to support this with his that i was all over the place in college and there was one point early junior year in college where i was going to major in something called visual studies completely different. A lot of the reasons people go into specific fields because of the way that they think of the way their brain works i mean right if you bring it down to the lowest level if they're more creative artistic business whatever it may be right that makes a lot of sense some answers that question so i'm curious what you're doing right now. Fulfill those interest at my school that was the closest thing that i could find to it true that the truth is once i got into it i realized wait this is much more focused on the theoretical and stuff like art history which i wasn't particularly interested in and that's why i ended up completely. There's something that wouldn't take on an everyday basis like you know these business classes other things that apply to everyday life which we'll talk about later in the podcast cuz i know you took some nba level courses but that's definitely helped me a ton just taking things that are actually useful that you know i don't feel like a wasted my time for that for months i was in them cuz there's a long time and a lot of work especially if you're not going to use what it is that you're doing right. Now looking back i have experienced now and i know what would the potentially best passes for a new someone who's new to codeine to follow the back then i didn't know if i should learn c plus plus or you have no knowledge of what do you do. The most irrelevant truth to you and to really frustrating yeah for sure i mean i know what i meant when i was younger the reason i learn c sharp was solely because my dad usually kind of intact but not really he had a colleague who is a programmer what language should i learn to learn to program with so just random and different things cuz i was younger as well i don't have any structured learning i was just doing this as a hobby it's i didn't know i was going to be a computer scientist thought a lot of my time because i spent a significant amount of time learning things that i don't even use today i'm sure they're helpful but it was just like the first two years to figure out what path even go down. Probably reason a lot of people get discouraged to is you're like you're always different things they start learning something they don't like it they have no idea what to do right so you did the math degree you said the math 2b wasn't crazy helpful or maybe gave you a little bit you don't really know so if you have the choice to go back and kind of changed things around you think you would still do a degree or would you just be a self-taught coder when you go to another bootcamp what would you kind of pick for yourself now knowing what you know now so that's a difficult. I think that here's the strategy i would employ knowing what i know now if i could go back in time i think i would enroll in a coding bootcamp the summer before college the summer right after senior year of high school before college have go to coding bootcamp and learn programming. Turn off for either the company or some other company that you start up and doesn't necessarily care about you and your college degree even big companies push really hard to try to get that. I have a feeling i'm probably going to learn more in this 3 months working there that i will and you know years of a college is based on what i've learned so far more advanced in the future i mean you didn't take a computer science degree so i guess you have an idea probably from knowing people that you don't know the exact courses but a lot of what i've taken so far it's just so fundamental are so basic or it's just so irrelevant to what i see in the industry right now i was curious if you know but you know what was exciting to you like what did you what do you like about those rules in which company was the favorite. I would say that i i think back to google with the little bit more nostalgia but i think that's biased because i join google as this story i'd new grad who had never experienced anything related to software engineer basically software engineering and so everything was so new when it was so real crazy and everything through that facebook i came there almost as like. As you know brand new exciting and fresh the second time around even if you don't know how it's done it's a little bit less impressive or with that being said i will say that. Like on a lower-level whenever when i'm using it on a day-to-day basis like i look at it a little bit differently i think about things will be different if i have an appreciation really for how much complex do you know that little button in the top corner actually took to make right is so do you do that as well. Glad that happened but website and anais you form that i filled out and that has taken me a long time i'll like copy paste all the input fields elsewhere cuz i'm like i know that there is a 50% chance of the engineer who wrote this doesn't have whatever i typed him beforehand so that's hilarious cuz i've made that issue so many times that i don't like little crappie website so. Operation and i know your founder of algo expert and ceo someone to ask you a good about business and stuff and get into that because i think it's interesting i think a lot of people want to hear about you know how do you start a business and what are some of the challenges what's fun with hard us maybe we can talk a bit about that to ask you how do you get started with a logo expert and do you wear you like an entrepreneurial kid like we always making money on your own i was just something that just kind of came up after you got through the coding bootcamp really interested in entrepreneurship in high school. A lot of them were things related to youtube to do online presence i tried streaming on twitch and i had a little bit of success there i tried a bunch of youtube channels no success at all there i try to see you like it's business ideas but i didn't have the coding skills to really develop them so no success there whatsoever so i do. High school i used to play on it's called a faction server just a specific game mode and i always was thinking i was like damn these guys must be making crazy amount of money cuz the way works for people that don't know is these kind of minecraft servers you can donate money i know you get special perks on the server so you can like fly around you can like that extra items whatever it might be and i made my own minecraft server and like grinding at like no 13 14 years old like writing a few custom plug in stuff like that and actually making like $304 a month and not just for me was with spark that stuff and how i got into youtube and all of us what's cool to hear that story. What i'm doing i mean it's pretty much just me my brother's helping out once in awhile someone to ask you what's the most important thing or like some of the big things you've learned since being a ceo maybe in like a management sense or just in terms of like running a business like some big challenges that you faced and then things you've learned along the way. Is so important flight we wouldn't be where we are today without go experts had we not executed like crazy and grinded like crazy and of course execution comes with many different things memes. Videos out there were just horrible night to learn so much before i was able to do anything on the platform like i think a lot of people forget that even the biggest like youtube stars the people we see today didn't get there from your getting lucky maybe some of them dead but most of them like know we're sitting in their basement at 15 grinding like trying to teach themselves how to do this learning the different concepts and i always use the example of like ksi or something like one of those big comedy youtubers. Youtube is a good it's a good example you too but you see what they eat in a day in the life of video or some other video that goes viral right in your like whoa that's so cool or that seems so cool. Nassar or whatever you want to call it brand yeah i mean i'm i'm with you on that i think the biggest thing i realized was how much work has to go it in without seeing any results and how dedicated you have to be to what it is you want to do it for me i was making $0 on youtube the first like a year-and-a-half that i was doing it not many people are capable of just sitting there and grinding and working their ass off with see nothing scene literally nothing in return seem like a few subscribers a few comments like those little bits of motivation is not enough to keep a lot of people going and that's what i tell people might look you want to make it on a platform like youtuber like even just anything i feel like you're going to have to be willing to put in a significant amount of work and i think to be able to do that you have to be somewhat passionate about what you're doing which is what let me do that there's no way i'd be here today if i didn't really like coding cuz when i was making those videos teaching it i was learning new stuff but i worked so hard for so long with. Nothing like nothing to show for it and then all of a sudden it came and then it's exponential that grows and grows and grows and i mean i can tell you a year ago i was making like a few hundred bucks off this right it wasn't like a big deal wasn't something i was doing for money was cuz i really like doing i was passionate about it and it turned into almost turned into like a proper business you can show for all those hours and hours of work the wedding at the beginning with with pretty much no results right. Passionate about editing my youtube videos or about writing the tags for my youtube videos. Okay so since retirement entrepreneurship i'm curious do you ever see yourself being an employee again or do you ever see yourself working at a company like google as on facebook whatever it may be your do you think that from now on you just going to be you know this business guy going to run some businesses may be a partner and maybe a meal transform algo expert what do you think if you had to guess. Write some code not have to worry about everything and everything anything and everything and just you know and you can't really do that when you're when you're running a business. It's hard to predict like on a day-to-day basis what's going to happen cuz you know the fire comes up here are you an email here something's going on there at you have to adjust so quickly and you can't does not really know especially when you're the head of the company does not another option is no one else is going to do it for you if it's all on you right. And yet you're just constantly working constantly catering to this other like this other part of you so yeah it's something and then there are days where you're kind of like i could use at least maybe some. of time of not this and some. of time of going back to more than normal life so to speak but at the same time like i've been doing this stuff done and that's the mentality that i think a lot of people in business. Maybe crack and i'm wrong i have to take on to get to the point where they are you constantly growing innovating there's no lex stagnation really at least from what i can see. Challenging yourself and punishing yourself telling yourself you have to be go go go all the time you have to hyper optimize your life and i think that even though it is unhealthy sometimes and it feels like s*** i do think that at the end of the day like that's what i'll bring you to that success or that's what will maximize the chances of bringing you to that success is first-year i woke up at 5:30 a.m. every morning for the first semester at least and went to bed at 11 p.m. and i mean that takes a tremendous amount of. I don't waste those hours that other people are wasting and that's if you want something like that their sacrifices you have to give up and i think a lot of people don't necessarily appreciate that especially if they just have no maybe a nine-to-five job or they haven't done that we're there no for a year on ahead and just grinding for themselves and their income at the end of the month through their satisfaction is completely based on how much they did no other factors right or auntie entrepreneurship. Four-week blah blah but there is some truth to these pieces of advice and so your point of wake me up at 5:30 a.m. and going to bed at 11 and one that gets to is having you know. A lot of people probably just need to experience it to really grasp it if they don't already just from what we're saying about personal branding so mean we both have personal brand of a personal brand of mine is considering your channel is actually your name and i was curious when you started when did you start your youtube channel and what kind of drove you start that cuz you were saying that you know you tried some different youtube channels and the social media so how did this one come about the the comments i i cannot pronounce your last name for the life of me i channel. I started it was because number one like i told you yes i had tried a bunch of other youtube channels in the past but this was something that i was already like interested in you since college i already know all the stuff videos editing videos and all that. Advice like i didn't even know that programming interviews were thing until i found your channel and sir watching some of your ass when your videos so that's interesting so i've decided those are a lot more valuable to me than any of the computer science classes that i've taken like accounting for example is probably the most important class have taken so far they just taught me so much like just fundamental accounting it just help you in everyday life regardless if you have a business or not understanding how things flow and how they operate i know you said are you set at some point you took some nba level classes so i was wondering if you could talk about what some of those classes were and what benefit you got from them if you would recommend people taking a course or taking business courses. Lots of very useful life skills like you said the accounting one friend since any class on finance even classes that are on more kind of abstract topics like entrepreneurship or management if they are taught well and good professors. Twitter was formed and how rent the runway which is like a fashion company fashion tech kind of company was formed and you learn really interesting things that that i continued to keep in mind to this day so. Cognizant you're having these conversations with all different kinds of people and hopefully we can have you on again in the future do anything for you that's 2020 goals sitting looking forward to exciting new stuff to remain focuses lately ever since we went full-time. That's you that's awesome all right we're going to leave it there, thanks again man really appreciate it and hopefully we can have you on again. ",
        "url": "https://www.youtube.com/watch?v=9PFgOQMS7RE"
    },
    "Time Out With Tim #3 - Q & A": {
        "text": "Hello everybody and welcome to episode 3 of the time out with tim podcast now in this episode what i need to be doing is actually answering a bunch of questions that you guys have asked me and kind of a q&a format so maybe posting a smaller video with some of the more interesting questions on the main youtube channel and then this podcast is going to be answering like 30 or 40 questions that i got asked on the tech with tim youtube channel and you actually have my brother on this podcast his name is noah i'll let him give himself like a slight little introduction but he's sitting like right across from me in the room and he's going to be the one asking all these questions he's just picking a few them from the actual comment section on youtube. Genesis so much of my time is taken up just by doing this youtube no school that i'm still in right now so i have no projects kind of on the burner right now that are going on but there will be a few that i'm starting to work on one that's going to be interesting is actually a tinder swiper so i can automatic tinder swiper i'm going to do a livestream creating not going to look out for it but yeah that's pretty much the answer for that question they're all right that's great so moving to the next question luke from twitter here says what tips do you have for young programmers we're looking to improve their skills make sure the one your coding you're enjoying your time and you're doing things that are interesting what i never want to recommend people that are starting out used to do things are really hard to get into math are going to super advanced programming because too often times i see that discourages people for me when i was young. I understand covid-19 situation is tough but i think that you need to approach this as an opportunity not as a negative so take it like hey this is giving me such a great opportunity to stay at home to not have to go into the office to not have to go to waste time in other areas i'm going to take advantage of that and do something with it work on projects learn a new skill do something like that that's really the only answer i can give you for that because you know i don't know your specific situation but i would say look at something like covid-19 or anything that is just an issue a problem and try to see it in the best possible light the most optimistic approach because that's just the best way to take on problems in life not be like all the stuff i can't do that you know so yeah so understanding the logic behind programming python games. Silly writing code but it doesn't mean i can't still be involved in the space learn new things talk to you guys make videos make podcast that's probably what i see myself doing if i get bored of coding and in fact that sometimes what i do all you know right to three hours of code i'll get bored of doing that or not bored but tired of it maybe like i'm a little exhausted and me taking a break is like sitting down and filming a podcaster filming youtube video but other than that how did they know about you and what was the interview like. But i don't need you no like a 5-hour course to teach me a language i just need to see the syntax and then practice it so i can't really recommend you any resources i mean like online is lily what i say just if you want to learn something just google it find resources that work well for you because it's different for everyone so sorry if i can't give you more help with that but that's my way of learning things just going online finding resources that i find it valuable for me that aren't necessarily valuable for you and i know myself learning really well so i can pick that up really easily but my resources are probably not going to the same thing that you would want to use if you were starting right from the very beginning i mean unless you're just watching like my tutorial videos or something like that no one can you give us any advice about how to start with machine flash deep learning to make sure you feel really confident in program. Formal step to really get into it start with the fundamental core learning algorithms which are linear regression clustering like forms of supervised machine learning slow like you know k means a k means clustering what else is there there's k nearest neighbors and then we have like support vector machines and stuff like that understand that math and the basic implementation of those and then from there you can get into deep learning please don't touch deep learning as your first thing in machine learning that's just going so above farm beyond that you're not even understanding what i and deep learning machine learning is if that's the first thing that you decide to learn so that's my answer for that one. Curriculum for myself and what i need to learn and then diving into that curriculum in learning topic by topic in bit by bit little parts until i can compile all that together and understand the topic is a hole so that's the my how i got into that from clarence here is learning python a good start for beginner programmer and where do you see yourself in 10 years from now yes i'm comparing its environment get the class structure correct understand how these brackets are happening where in python is he going to two minutes i got download python comes with ideally you know i literally run ideally i print hello world. First year of high school and even just watching some attempts tutorials online and i was going through my first programming class it really help me go through just because the way he runs you through the fundamentals of the language it is really helpful because i still have all those things remembered and they're still in my brain even though i haven't programmed in over a year i could still sit down open up my id and still bright some sort of code based on the knowledge that i got from him so he doesn't program that much like he doesn't work on side projects on his own he just started learning programming for high school cuz you staying the course and for the summer camp they were working out where we were kind of like i was teaching the coating but he was helping out in there so just keep that in mind you know he's a very beginner level programmer and was able to pick up python pretty easily next question. Help me a ton and that came from practicing communicating i was not this good when i was 14 or 15 but by posting videos almost every single day on youtube doing podcasts like this you learn how do i take you at your thoughts clearly which helped me tremendously so that's what i'm going to say is the number one thing to help me get to microsoft was really just being a good confident communicate with here we have one person spend a lot of money on the fees when we can just use that money for doing some courses related to programming online they have difference in north america y means a lot of different reasons university gives you a lot of things that you know some online course stop by some random instructor. Not and i could be you don't structured curriculum like you have actual things you need to get done you know there's no excuse you can't not wake up on friday morning for the class or if you don't wake up you know you know you don't like consequences for that i think what university does for a lot of people and you got to ask yourself this you know should i go or not is am i going to be motive enough if i don't go to learn all of these courses to learn all these topics to do the things i don't want to do am i going to do that or do i need something like a structured learning environment that's going to force me and really influence me to do those courses in those topics and that's to me what the big deal is university i'll never tell someone they need to enroll in a school or go to a program or put themselves in any kind of debt do that anything you need to learn you can get for free on a hundred percent guarantee you any topic anything in the world you can find it for free online the question is are you going to do that are you going to go in and you know spend 8 hours a day learning and doing that online and going through these courses cuz a lot of people. Make the excuse like all i'm just not going to go to university cuz i can learn online for free but are you actually going to do that are you going to spend 5 days a week every single day learning right and doing those courses if you are great don't go but if you don't think you will maybe university in a structured learning environment is something you need and it also does give you a huge advantage in terms of that piece of paper some people argue with useless but that is going to help you in life is going to help you get a job is going to prove you have some level of intelligence and competency that you can't necessarily prove just by showing watch a udemy courses on your resume so yeah i mean like it's great to go online and even ask me a question like that what did you do now. If you want to experiment with ai and ml like do that you know if you want to do web development do something like that so that's my advice to you figure out what you like and if you don't like something taste a few different things tri-c for a week then try javascript for a week and then try making a website like try all these different things that's what i did when i was your age i tried app development i tried websites i tried i tried games i tried literally everything until i found what i liked and that is what i would recommend to you. can you give us a list of 5 beginner python projects python projects. You have some inspiration are some ideas for somebody to work on all right next one might be a little tough might be going too deep into your personal life right but python her girlfriend just want a girlfriend in life that's not something that i'm really that interested in you know what some people might find that controversial and work different inside before me know i don't need someone like by my side like that's not something that i'm looking for right now but i think you can have both python and a girlfriend i know many great programmers many people that are youtubers to do as much as i do that have girlfriends and it just has to be you know the right girlfriend preferably one that knows how to code but at the same time you know it doesn't really matter so yeah alright by the way love your content you're a big inspiration thank you. Already next question is coming from trig he says hate him i was wondering at what point is the necessary to jump to a new language i've been thinking about starting to learn javascript but i don't know what i should lose it interesting at what point is it theme to jump to a new language so there's no definitive answer to this obviously it again this goes with what you want to do you know if you know yourself really well and you know like this language i want to use forever do you need to jump to any one probably not what i would recommend if you are looking to jump to a new language is to jump to one that's completely different than other language you're learning right now might seem counterproductive but i think if you're learning python for sale that are in the same paradigm language. Who says i'm doing a masters in biochemistry i'm interested in data science a part of my majors project but i have a few problems and where and how to start do i need to be really good at math i don't know a lot about statistics so it's hard for me to really answer that for you i will say didn't know you do not need to be really good at math but you should understand math and you should be able to look at mathematical equations and you know what little bit of struggling figure out what they're doing and why they work that's what i say with machine learning and ai and all these kind of field you don't need to be like a god at math you don't even have to have done those classes you have to be willing to learn the math and understand why things work rather than just implementing something because you've been told that it works understand why it works will help you a lot and that's. Project id so many different ways to get into data scientist probably just finding some course online there's probably someone who's made a video like how to get started with data science that you can watch it would probably give you better inside than i can tell you right now but no you don't need to be good at math just be willing to learn the math and try your best to understand why things work notches implement them next question here yo tim what what are some things you do when you're not coding or your offer computer is there any genre books you like anime tv shows at once piracy the most and what's one thing that keeps you going what's one thing that keeps me going to the most what i like to do a lot of little questions inside of their. Do not i really like fishing that's what i do end of the summer fall months i'll go with my dad will go for a week weekend is my seen that on my instagram and you might have seen me talk about and some youtube videos stuff like that but my life is really closely centered around tack right so this is a business like this business takes up a lot of time so i don't have that much free time where i'm not programming i'm not you know working on business deals are sponsorships or things like that so i can't really cannot tell you much more than that then i enjoy hanging out with my friends i try to reserve my nights later after 7 p.m. to do things that i enjoy like watch movies tv shows you know i'm just a normal guy i just work hard when i'm working during the day. With that being said i hope you all enjoyed if you did make sure you leave a like subscribe to the channel and i will see you in another podcast or youtube video. ",
        "url": "https://www.youtube.com/watch?v=CV2YpmrHoFY"
    },
    "Max Holloway Breakdown: The Mentality of a Champion Fighter": {
        "text": "The joe rogan experience on paper you put down my stats no one's going to pick me up a fight. The mind is such an important part of my friends and it's raining hard and i'm just crazy like like most of us and it from 15 to 10 and then from 10 to 5 same thing and it from champion everybody else it's a mental it's a mentality thing is this something that to do with iq and something that's only 10 change like we're all good we're all at the mecca of fighting the ufc is where everybody wants to be but what makes you a champ what makes me a champion you not something i'd be at. You're stronger than me you faster than me what is the difference is that things like i'm willing to do something that i don't know if you even thought of doing it or if it's presented with you that if you going to take that chance and on but it's also you were willing to put the intensity and do training camps in the focus and dedication into your craft that maybe some people are and maybe sometimes people that are really talented things come a little too easy for them and they don't want to work the yard. He's kind of made the team i did he's there with you and he sees that and he see you break and then pushes him and now he's about he's with those guys that says who's those guys who's freak athletes but they all have the mind but this guy don't have the freak at least but he get the mine and he's hanging with them. My mentality came by like i always fight with my younger brother. Is a dirt road as i pretended like apples always up there drinking his beer take this damn dirt road so we don't get into trouble. Time and just make everything right again or try to go and get as close as you can to make everything right against great advice that you still have time to catch new episodes of the joe rogan experience for free only on spotify on spotify including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=uXCGM-CNnFI"
    },
    "Max Halloway on His Performance Against Calvin Kattar": {
        "text": "The joe rogan experience that you were able to fight in to train a full camp for a guy like bokanowski especially a rematch with no sparring with no partners with no nothing. You know i like you get a 200% of yourself but it comes a point like everybody thinks i'm i'm telling everybody stops boring you know what time the young kid starts pouring pouring when i was 16 i had this far but it comes a point where you far enough to the point where everything happens or even fight so i fought injured isparta injured you know i got i got i got hurt at to come through stuff like you need this times before the show because when it comes in the show and you get hurt in a fight or something you panic you get buzzed in the fight you panic but then if you do it in this boring or these amateur fights then it's. I'm trying i'm trying to get ready for this guy you know i mean it and a lot of people that's when he go and stuff come in and so on so on so i didn't go i think so we figured out a way where it worked for me in the end you guys got to see you know it's like i just i feel so good my bought everything was like everything is good i feel great. Mcmichael use the first round i was like i was okay then. Everything is not doing that i scott focus on him you know and i mean like me talking as a fighter and no way i was like give me a shot and this guy's you know he's a puncher put someone down you know but you know it's funny cuz like teddy atlas said the same thing but. It's after five rounds and it's a fight you know i like i thought this supposed to be the two best guys in the world you know i mean like my take on it was like why why don't we just have these fights yet we have the rounds with his going to someone wins the fight in the world including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps. Can download episodes to save on data cost for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=EbMgHbIjyow"
    },
    "Joe & Max Holloway on Genetically Engineered Monkeys": {
        "text": "The joe rogan experience will you live in hawaii which is a really interesting place right because there's a lot of non-native animals that have been introduced to hawaii like eggs in a lot of weird birds lot of weird road and some plants and all kinds of gotta be. Gorillas and stuff. She was sleeping in the bed with the chimps right wine and end and took xanax she's feeding the chimp xanax and the ladies friend came over and the chimp attack the lady's friend. I take a chimp and genetically engineered to make it almost as smart as a person or a smartest person i wouldn't be surprised if someone's already doing it there it is he's eating her shoot him scream the chimps owner yeah yeah he was a huge shrimp and he he tore face apart i think he's bitter fingers off did that woman survive she was torn apart show me the pictures of the lady and they know that you like your balls they know that you need your feet those are the things that they attacked attacked your face they tear your face apart they pull your eyes out they bite your fingers off they take dick off and they tell your feet off. J&l like fighting just want to call time they're saying like you know like modern warfare and stuff is like to like wi-fi in chevy going to have wars and whatever and then the next thing is like i hear robots and s*** but what is there to do is start breeding crazy silverbacks and chance and whatever like they can talk and interface computer interface with a chimp's brain and you have some helmet or they could see things like they can see like infrared night vision. Iron man iron man play both sides two at one point you know on spotify including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=ox7wMjAmN0M"
    },
    "Floyd Mayweather's Flashy Style": {
        "text": "The joe rogan experience of the idea pulled up a yacht is the it's the opposite of what everybody tells you about fighting the fighting you have to stay hungry like stay humble you know like like you know rocky 3 style constantly flashing money million-dollar watches you know of a fleet of super expensive cars and it still sucks everybody else does. Undeniable what threw that ball and nights he never i don't think he was doing drugs or drinking and run home from the nightclub so he would go out in vegas he be partying it look nice party drinking water and then he would have his driver drive and it with his f****** pants on jeans on he would jog home to do was always training always try to never got out of shape because that's a lot of the motivation for fighters is to one day be that champion one day have that money where your family's going to be taken care of for life you don't have to worry anymore do you hit that spot like and then what keeps you going to remain a student. That's why there's a famous quote that is hard to wake up and run 2 miles when you're sleeping in silk pajamas i forgot what boxer said that but you know what to do something that's never been done maybe that's the driving factor now you know cuz a lot of guys money might be the driving factor but once you get the money maybe you set it up to try to leave legendary things behind like. Bratayley did postpone that right i thought it was a different fight in japan think it's logan paul it is they postponed it though because they weren't didn't have enough pay-per-view interest right is that the jamie know the not according to them but. I was surprised that when i thought i was going to beat him but i thought it would be a little bit more happening in that that was a day for that fight you look like you was a little bit i shave like your little ring around the midsection and smiling like smile like he knew what he was going to do like how you going to beat me you're so little power punch including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app. Go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=YVU-2vk3O9g"
    },
    "Conor's Lack of Trash Talk During Poirier II Lead up": {
        "text": "The joe rogan experience what was it like fighting conor when he wasn't an a****** was that weird dude you know fighting is hectic already yeah you're about to go in there for 25 minutes and you've been training so you know what's on the line so it's just a lot of pressure so it being a little bit more calm for me was was was smooth sailing man you know cuz it's already hectic enough it was nice without having guy spilling beer and you going to die on the way to the walk is it to me so it's not good for him. Or he doesn't want on the way like maybe he's just maturing and he's a difference in oil change maybe he's a different person but yeah i think also the amount of s*** that he caused in the khabib fight me realizing at the end of it what it happened dudes jumped into the cage and beat his ass guys were jumping and khabib jumped out of the cage got a fight with dillon danis it's chaos i mean it was so nuts and then you know what it happened before that with him throwing the card at the bus and fights got canceled cuz broken glass a couple other guys got cut with with with the glass that was flying it's like he had done so much and f***** up so much. What's old fights yeah like aunt like the jose aldo fight he tortured jose aldo from months and they did that crazy press conference will be toured all over the world i mean ripped a picture in a much more aware of the magnitude of the moment and connor seem so relaxed and i felt that same thing though the first time i fall connor i felt like that when the bell rang i was like a deer in the headlights it's happening here we go all this you know all that talk and everything over the months just sat in my head and i just read into it too much. too much and i think that's probably what i'll do. Well there's so much mental involved let me know for sure physical but it's also look at the mental just to get yourself to training camp right to cut weight to show up to do interview at the interview press conference after press conference you know how hard is that same question over and over what's the difference between the disgusting and dustin 6 years ago encounter beach you like if i heard that question a thousand times before you answer questions and it's just going through the motions i just somewhere fun. how was camp how are you feeling what's different between. He's in before and then the last two weeks just leave the f****** fires alone leave me alone right let him train only do the big ones like a espn sportscenter interview my computer i would say over that whole fight week 3 hours maybe total. Yacht yacht cost 10 million bucks okay it's 8:10 a.m. you better have a hundred million you know how much it cost. Free only on spotify back catalogue jre videos on spotify including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=_R3ipbYZNBk"
    },
    "Dustin Poirier on Beating Conor McGregor, Calf Kicks, Possible 3rd Fight": {
        "text": "The joe rogan experience breakdown in detail with connor very interesting it is but i see a lot of people talking funny stuff about like the leg kicked it and knock him out what happened like sodc says it in the detailed breakdown i kick conners cast and connor steps back in his leg kind of goes and dc says it will that's electric that you know hurt his leg or whatever but when he went after that like you kind of reached down to grab the foot into an uppercut and i was switched and so i threw across from my backhanded clip them good and that's when he took the step back and was hurt i think that's a detail people are missing and then it switched over to the difference. Has made an mma over the last few years it's really not it is man and it doesn't take many and it doesn't take as much commitment you know. i kicked you turn your hips / muy thai style you're really set in your position whipping this cat kick you can flick you know you look like a job and just catch the top of the calf and it's it's so wild that this one kick was almost ignored i would give benson henderson credit because i think he was the first guy to start use it in the sea but for whatever reason he didn't have the same impact with it it just i don't know i have to go over some fights huge legs i'm sure. Debilitating your nerves in your foot kind of stopped working with you it's it's bad stuff there's no meat there either i'll explain to someone i'm like just just karate chop your arm right here where the bone is it hurts just to do that now imagine someone kicking that and that's what it's like when you get kicked in the calf there's nothing there is no meat and even when you turn your problem. And it made me hate the process cuz my quality of life sucked you know training camps were torture you know i'd walk around 190 i guess the one 91-87 or something and it was like really short notice my team fly out there and 30 pounds overweight. I feel like weigh-ins what kind of blurry i don't like my memories going from weigh-ins is this is not good for you do you think it makes sense though for you to be fighting conor for the title no i don't think so do you think it would be oliveira has been away so long his last two fights and 155 he's lost so you can put them in there for a title fight right how could you you know justify doing that when they got when you have guys like olivera. Prominence and you know this is also the time when connor started moving away from the sport took time off but boxing you know then came back and had the fight with khabib and then came back and had the fight with cowboy the calf kick was never in play in any of his fights but if you look at him stylistically in this one thing i love dc detail that other doesn't espn it's amazing but when he broke down connors heavyweight on the right leg he leans in like this all the time he puts a lot of weight on that right leg when you pause nat southpaw stance and because you fight southpaw a lot as well it just opens up that kicks so big and it's such a big weapon and sometimes like you said it that wide stance as well it's just hard to check the kid from. Like you seen friday bounce back and forth to boom attack and he has a hell of a a left-hand when you know he's not got a bunch of guys with it with that counter that pull too and that's what we worked on a lot that training camp with my boxing coach died davis is is deadpool 2 dating a man to throw the pool to round. Shoulders i was having fun asked him that's think i told him how you like that clavicle i just messing around you know how did you like that clavicle right. Put my head on the other side pretty sure you look more muscular or after the second part it's fighting man i don't think you ever really keep things fresh and keep him guessing. Cuz i'm still my wife's birthday is coming up so we're going to go somewhere for a couple days like i'm still not i will if it if i get to call and it's time to go to work i will lock myself in training camp but i'm still not right now ready to just go to back to florida a month removed from from the last fight and the lockdown for another 10 weeks or whatever it is so we'll see if they call i will do it but i'd rather it be a little bit further let me enjoy my life back home in louisiana before i go right back out to florida or what i want to switch up you know we'll be right back in camp getting ready to fight we're not really evolving outside of training camp for me to learn things at training camp. It's just constant everyday under pressure but it's a the time between camps like right now and i'm in the gym having fun rolling and doing like kickboxing drills are my friends why i feel like i'm the big games are made when i'm having fun and i'm kind of tunnel vision and training camp i'm showing up all right let's wrestle all right i'm not having fun exploring different things easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=mEjlGq_X9RQ"
    },
    "Robert Bigelow Tells Bob Lazar Stories": {
        "text": "The joe rogan experience you had you had encounters with bob lazar you know bob and you you were around when bob was our first going to be all about the mylar balloon what's the area out there you know and so so are we all go out to bob has a mylar balloon which really bounced is a radar signature a lot for its size and a bottle of gas. A human so we we find our way back out in the desert out there we're kind of i'm thinking we're on a ufo watch which is always fun sometimes the best thing is the food you take a walk right and you're out there under the stars and it's nice and you have a good time watching so but there's a rustle of things going on here and next thing i know there's a balloon is mylar balloons inflated and there's a slight breeze and we're on the opposite side of the mountain range that supposedly you know my life's just passed before my eyes. Is going to come get us not going to spend the night in jail so you know it all just unraveled real quick was this before bob got in trouble for bringing people to the observation point to watch cuz it's liz tell story about bob real quick bob said he work for area s4 and he was hired to back engineer with a believe we rarely and crafts along the lines he had this top-secret clearance and along the lines of all this happening they're monitoring his phone calls turns out bob's wife is having an affair bob doesn't know about this they remove him from the project cuz he believe he'll be emotionally unstable if he isn't it so he's he's freaking out not knowing a that his wife is having an affair not knowing why this project doesn't totally understand so start telling people about what he's doing and telling people listen i can take you to a place where once a week they do these tests so he starts bringing people to this area they see these objects flying in these spectacular. Ways that we really can't do with any of our conventional aircraft and then bob gets in trouble for that then bob goes on the george knapp show and starts explaining all these different things presumably for self-preservation because he the best way to private probably protector on life is to go public with this and explain everything that's happening and they could discredit you and make you a great and not but if they kill you then you know then it leads creedence true story everybody was and i wasn't it wasn't part of when years. Beyond george knapp show somewhere in that time but i wasn't aware of until much until i don't think at that time i was aware of him taking people out on you know wednesday night's to go see something out there i kind of missed out on that or whatever and i don't think this was anything like connected to that i think that was before this spacecrafts they came from another land that are that are using this element 115. This this stuff is just a theoretical element it wasn't even proven by particle collider to what 2013 somewhere alone i want that he was just theoretical up to that point you telling you about all this stuff what was your what did you think i wanted to reserve judgment until i knew a lot more and the more he talked the more interesting it became the more research that george did things that he uncovered became more interesting and and so as i said a while back i think george bob's the truth of the majority of of everything a baba said i wouldn't bet against it how could they be arizona emissions for different reasons yeah sure that could but. I like i would turn to say bob is is legitimate and you know i do there certain aspects of things that are parts of stories that you wonder what how could this happen on so forth but i think if you if you take on all of the collective information and the work that george knapp is done to validate things it's awfully damn impressive but george is such an important part of it because he's a legitimate investigative journalist and that was his career and so he poured himself and exposed all the different aspects of the story that seem to indicate that he's telling the truth oh yes. Right right so i think until you i like the philosophy of reserving judgment until you have a preponderance of evidence that really moves you one way or another you don't have to have a hundred percent i go by reasonable doubt but what was it like for you to be this guy who's had this deep fascination with flying saucers and here you are talk with me tell you my experience with bob doing the podcast with bob i wanted one or two things i wanted to go all the stars full of s*** or i wanted blow this guy's it seems like he's not full of s*** i think he's telling the truth i think this guy really did encounter these aircrafts and really did work on these spaceships whatever they are that's what it where i'm at right now my experience with him my communication with him he didn't seem like it's full of s*** at all he's clearly a brilliant guy his story has not changed at all over the 30-plus years he's been. People that are giving you this information that like maybe they have been here forever maybe this is a part of an archaeological dig maybe they've been trying to study these things for decades with no no advancement at all so we came across or myself in a couple other people came across the folks who could collaborate some of the things going on out there such as silent craft actually lifting off at night time not looking as though the control was very good but actually lifting off maneuvering like a real small trial kind of thing and that fellow observe it from a distance where he wasn't supposed to be george has come up with with collaboration i think from true story other sources also besides what. Sad about certain aspects of things out there it's just that bob story in the so much more in-depth so much more detailed like that book that he talked about years ago coming across amazing things to tell people about the book a book a book that bob was allowed to look through or he actually sore he seized the opportunity to do it when he was in a room where the book was but i think that was by design and it was some kind of a holographic book that has you open up the pages whatever the stories were became a hologram that's my recollection of a conversation that's decades-old now so. You know it's you'll have to talk to bob about that would you or talk to george okay and cuz remember something like that i mean that was like wow what an amazing way to portray information and some kind of a book and actually have holographic images coming fourth out of the you know i don't know it just was so that i have never heard of that being repeated any place in terms of something else like that happening and so much that happened to bob it was so unique there was also some very strange summary of what they understand or what they believe to be true about the origins of human beings and that they believe that what these visitations were about was that human beings are the product of accelerated evolution and that the species from wherever i've been coming here and doing genetic. Experiments with primates and created human beings which is the ultimate like who knows like wow that's fun to think about but we were talking about this last night like how bizarre humans are that at all these things on earth where the only ones with shoes are the all these things were the only ones that have to wear clothes with the only ones with jump into metal boxes with rubber tires and roll around these hard surfaces that we created or flying planes or send video through your phone to other people that are on the other side of the continent where weird or real weird we're way weirder than anything else that exists and if we are really a product of some sort of accelerated process like that this is how they get the party started on this planet to find semi intelligent curious animals that are using tools or using you no opposable thumbs and they they do some things to them. Yeah the there's a large variety of potential beginnings more evidence for some than others right so that's that's always the trick have you considered that like a subject that you've deeply considered and thought about really really i'm here i don't want to look a gift horse in the face i'll take it for what it is you know i'm more than where the human species come from particularly i'm more driven by other kinds of things that could make a different today going forward. So getting back to the bob lazar thing when you first got to know him when you first were considering the story and how crazy it was what was it like to to meet a guy who at least by his own accounts had encountered this thing that you were seeking wilbon's a likable guy he has you said he's very smart and so he's interesting to talk to write and and so that's more than just entertaining to listen to his story is profound right and so it gives you an awful lot to think about and to try to to position as to how can you measure future information you might get against that story how can you verify different kinds of things and so i've heard a lot more silly things i think then and then what bob was talking about. Didn't seem all that ridiculous and in the more you get to talk to him the more you get to know him and and people like george who's an investigative journalist it gets more and more wow and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=WUYhCmfE1a0"
    },
    "What Got Robert Bigelow Interested in UFO's?": {
        "text": "The joe rogan experience you and i have some shared interest clearly in the world of ufos but i want to talk to most people know of you because of bigelow aerospace they know that you're this billionaire investor and you're a very successful businessman but you have a deep fascination with ufos of may of that year my grandparents had a very close encounter it was dramatic and they were taking an afternoon evening drive in the late afternoon up into the mountains and coming on back down to las vegas and they saw what appeared to be an airplane on fire. Hit the object became closer and closer to them and they pulled off to the side of the road and at one point and it filled up the windshield i thought they were going to die and at the last second it shot off and and disappeared and i learned of this story when i was probably 10 years old and cuz i was three at a time and my mother had told me the story so i approach my grandfather he wouldn't talk about it now after all these years like 7 years have gone by cuz i was intrigued with it and went to my grandmother and she only would say a few words but she wouldn't talk so i got the story from my mom and and they had my grandfather had to sit on the side of the road there in the car for a while to recompose himself. And because i thought they were there going to die and then fine when i was able to drive on back to las vegas so that was the beginning for me did you ever describe what he said it looked like a plane on fire but what was the shape of it as it got closer i don't recall any kind of shape that was that was described it wasn't playing they knew it was right next door to my grandparents and the family had an event that kind of started things at that date for me other personal things came later but for the family that was a big deal. The nuclear bombs that were dropped on hiroshima and nagasaki and all the tests that united states are done and russia had done and that there was a lot of interest in obviously in that actually russia and drop any bombs by that time right right it was after that but that there was interest in our species by extraterrestrials cuz they let all these crazy assholes detonating nukes like let's go take a look at them during the war these lights that were following bombers and they tail-gunners were the ones that saw the most often the course and then that happened through the through the war and then and then of course roswell but for that was arnold right and then in july 8th was roswell. I think i gather my feeling simply is at without any kind of other other evidence or proof that that was a huge stomach stimulus so this was around that time then you would heard about this is a part of a family discussion right and so that sort of ignited the fire initially and i started asking my friends as i say when i was about 10 of you and your family and close friends told me things that they had never told me before so you know it wasn't that wasn't necessarily exclusive event is what i'm saying other people in las vegas had had seen things that close proximity as well. An obsession of yours for so long it started with this but what personal experiences if any of you had well when i was probably 7 or so 7 or 8 i used to have white chocolate up on my life to just being silly dreams and i have maybe five or six of these dreams and the i could never make sense of them and i would be laying in bed on my side and typical dream always the same there would be three short somebody something's and kind of monk robe and so i couldn't see any face couldn't see me appendages and these three whatever's were standing there and they were not too far from my eye level as far as the heights and so forth a child size. Avid comic book reader but there was nothing in the in the whole genre of comic books that are related to the outer movies and we didn't have television las vegas till 53 or 54 and even after that it was carroll broadcasting you know at first but so it made no sense to me and so are my lifetime i never mention it's funny how you keep things secret and no good reason maybe i was being embarrassed to talk about it but i finally thought well maybe it's just dreams maybe it was something else and so that was a first event personally that i had at that time in the subject. Start my process as a researcher and as a student in the subject and began to talk with people who were who made it their business to be experts in abductions and the more i got into the field and sat writing out questions for the researcher for the therapist who would be asking the questions and and i'd be sitting there watching the process and just overtime i thought well maybe there was something more to it but i'm better off not knowing anything. Phenomena was was very proliferate dent in the population of seemed like even we did a survey called roper poll and we repeated it three times so that the margin of error was really reduced to like one one and a half percent and abduction researchers came up with a the 10 questions and so they we distribute that and the the conclusion was of them according to the researchers and according to the poll i am not qualified to speak to the accuracy of what are the questions were that relevant to the conclusions or not but that's what they said and so and i had in my own research found peep. That i put them true regression i'm not personally but i found a hypnotherapist it could do that and i found a number or people just hear they're scattered around maybe somebody my own staff and they would come up with these these stories in these events one of the criticisms of john mack and hypnotic regression in general is that the idea that you can put the idea that you can put a memory into someone's head that you could suggest things and you could create false memories and that this was something that i've read in the criticism of his work that this style of hypnotic regression and brain up these very specific scenarios to a bunch of different people you can sort of helped create especially in people that are easily influenced or people that are open to suggestion you could put these false memories in their head and so you know. Especially when you're dealing with something as fantastic as a driver for alien abduction oreiro visitation or something like that there's also something called screen memory but dealing with the first the power of suggestion that's absolutely true but my experience was with different hypnotherapists they went out of their way in fact it's a maybe if they did make a suggestion it was just the opposite they might say okay you're on board this craft you know where's the corner or of the of the room that you're in while there were no corners may be corrected right away by the person being hypnotized and so they went just the opposite direction on purpose to makes it make suggestions to maybe coax the person to come that direction they wouldn't do it the prison wouldn't do it ice cream memory is different. Play if somebody has a very close encounter with supposedly somebody that's that ct don't you leave that it that the memory turns out to be entirely different and that's put into you consciously and you recall something entirely different than what actually happened maybe you saw deer to deer on the road or something of that sort or maybe there were owls or whatever so that's what's purported and download episodes to save on data cost all for free spotify is absolutely free you don't have to have. Premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=BtT_iHMEt1A"
    },
    "Will Conor McGregor Still Be Competitive in MMA?": {
        "text": "The joe rogan experience controlled him on the ground. Stop them cowboy is always a slow starter yeah i think it's just you'll maybe it's time maybe it's maybe it's desire maybe i don't know i don't have the answer but i think the time is coming when. All time if not definite the best defensive boxers all times forever and one of the smartest boxers of all times as far as how you did is career and then you lose it could beat you say it's the greatest 155 ever boxing pacquiao. Go out there and get it stop telling about your training schedules going to be in just f****** do with it f****** jim tells you to do if he was still he was pretty f****** rich when he fought eddie alvarez you know he's already a multi-millionaire. I think he was a little bit slower it's like you look so fast and some of the other fights. Guy that's never been known to like switch back and forth he doesn't like to have left leg for it's not that's on a common thing for him so once his legs getting chewed up you know his it's not like he's got that option looking fight just as good from orthodox now and it's probably worse from orthodox. Because of chandler's really coming from bellator over to ufc but come on did he just knocked out dan hooker. Cuz just in case he just got his performance i like. Including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=hKIlZWBT6j8"
    },
    "Kevin Holland on Upcoming Fight with Derek Brunson": {
        "text": "The joe rogan experience what is your thoughts on derek brunson we talked about a little bit earlier but you know he's obviously a veteran he's obviously guys been around his fought stylebender he's real fast hands look great but never really been tested against like a veteran and then you saw wasn't really ready for that yet. One out of ten thousand and you that one out of ten thousand i'm at one of my 10,000 going to find out we have a lot of words back and forth. I don't know he says he's about that life that i got dildos in the car so you can get it when you get it really bad and then you don't take care of yourself adequate time to recover you go back in before you're really fully recovered and also you're not taking care of all the inflammation issues that you have with your diet with your supplements yeah you you hit a situation like. One of the best fighters in the world can't get a fight can't get a fight. Is he always like he's not necessarily you know saying that do you have these guys are for sure fighters but they're not real fighters in kevin's mind. Never be that soproxi those guys you know but it's like if you go to 72 this might make sense or are you smart move you about 285 this might make sense to use smart move i was impressed by the way he knocked on their shirt just p**** he took the smartest route which was keeping it standing and i thought you know but knocking out after coming off of losses you know what i mean and i i know i smack him a couple times i know the romulans maxim a couple times you know what i mean and i know and ultimately letting the last match. Take this guy down she'll come out he's obviously not going to go away from punches to might have went out there to them down like donna punch on the porch on sub. smart smart fighter props to him but what happens when you can't go out there and take it easy smart route 520 fighters really f****** good that's why. What's he's just like a disease though i mean i mean you know michael jordan still went out there and one you know difference at the same time. 70 and i'm staying at 85 and you know it's like you know maybe one day when he you know it's over being a little tired he can get back in there and get some fights and it will be okay watch back catalogue jre videos on spotify including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=3BhSH5hUPB0"
    },
    "Who is the Greatest Boxer of All Time?": {
        "text": "The joe rogan experience. Plus victory before his first defeat though what is like how many something is free. You stopped me but you didn't never never put me down that was the st. valentine's day massacre right. Those are all win win win win win win jake lamotta so we beat him at 36 and only lost a unanimous decision yeah i was right and then he beat everybody else i've been to a job at raw with jose bharosa basora rather so you made the for you know he lost his first loss and there's a decision to chickamauga. There's a level that you can reach the can only maintain for certain amount of years and it's real hard because i think that's what i said yesterday i think if muhammad ali had been in the same era as mike tyson he would have been better because mike tyson was around you you get better depending upon who's around you and the one you are in an error your kind of defined by your competition i'll leave as defined by joe frazier and defined by joe foreman and and all the guys can norton all those guys that he fought in his era but this is a different era as a different. You going to get it by them right and get hit by a giant f****** hands you know a guy that was close close to the mafia you know he's like and he peed all those guys you know it's okay and maybe if he doesn't have that three years off you know maybe maybe maybe who knows what he stood for something. Fix the alternate you know i forget what happened over there you know he ended up not fighting joe fought he won the olympic gold medal they had actually rematched as prose and then joe stopped in my fourth or fifth round and he was a george foreman. Olympic city won the gold medal and it he was like 24 fights as an amateur that's all the fights he had never lost its nuts and it's just crazy 1968 olympic games amazing and never lost. Something then when he fought like when he came back you think that mike tyson was faster than that version. All kinds of trouble in the day there was a glove glove if i remember right. He looks dead his ass hits and it pops back up but it's like what when joe frazier when joe frazier dropped him you know it's like his ass hit and it pops right back easily seamlessly switch between and audio experience on spotify you can listen to the jre in the background while using other apps and then download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=dF38onQHkQA"
    },
    "The Story of Former DC Mayor Marion Barry Getting Caught Smoking Crack": {
        "text": "The joe rogan experience. he was just re-elected. And he was walking right by it was on some other show someone go grab them go grab them get them in here so we open up the door and marionberry just walked right in and he sits down and then is he gone is he dead. Try to railroad you because i didn't like what you were doing and i turned out what year was did he get caught smoking crack. They might have them that they have the hippie i have a lot of people at the governor that's what i want to know who had the camera camera. He's doing what's legal but he's in a chair and he just not going anywhere just pounded it was in fact 93% pure cocaine. A history of the fbi barry noted as he offered evidence to support his claims the fbi attempted to kill me why would they have an emt on the saying on the scene if they weren't trying to let him shoot his criminal activities. I don't hang out with you they don't hang out with people that they're interested in that or that story but you know week with the people hang out with his urine in a basement somewhere where all the kids get f*****. These people are crazy and they re-elected them and look they don't care about gray get it right now as a grown man who is probably like a broad range of opinions it's probably a lot of people that i hate what do you give a f*** if you smoking crack he does a great job with the budget i don't know if you did a good job and smoke crack. Job that he did that he f***** up not for the fact that someone who set him up but still i rise. Nothing is different and easily seamlessly switch between and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=mZyNfKyzDHU"
    },
    "Analyzing R. Kelly": {
        "text": "The joe rogan experience off of your sentence with each album you put out oh my god and all the money goes to charity. To listen to a new r.kelly album listen to one that he did release the one song they did release. Cobra kelly is an innovator man r&b he's the king of r&b. What the f*** is going on you don't say nothing like the s*** with the hotel take a lot of that s*** was b******* but i think r.kelly a nasty motherfuking he needs to go to jail but you know i'm saying i think that he's going to be a hoe. Does this man have his fan i mean he is dancing in front of these ladies in their he's singing to their face and then patted him down and people are screaming for the people that was just listen this is wild s*** a while. How old is everybody like what is this it's like this stage s*** like doing that the art that he produced like being able to stand on stage and this girl grabs his dick in front of everybody i'm not endorsing anything he's ever done ever that's criminal but that is wild. Ohmygod ohmygod ohmygod. Tell me this how to f*** she know i was with them. Including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to. Spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=EvSJAANX3pE"
    },
    "Freddie Gibbs Talks Cocaine with Joe Rogan": {
        "text": "The joe rogan experience. Killer using some / 22 you know this is some real s*** because it's a crackhead back in the day i shot the niger 9 times would have checked out and you kept running down the alley different. I want a legal to put out the story saying that black and mexican exactly raping white women and they blamed it on this drug they blamed it on marijuana when marijuana wasn't even called marijuana back then the marijuana was wild to mexican tobacco made this new name so when congress was making marijuana illegal didn't even know they were making hemp illegal with a target was was hemp the commodity they were trying to make the paper illegal and they were trying to make the textiles illegal cuz william randolph hearst not only did he run hearst newspapers they also had paper mills and then on the popular popular science magazine on the cover it said hamp the new billion-dollar crop cuz it came up with a new way of processing and decatur. So that he could just keep his paper mills and keep making them with wood and keep using all the things that he's already used before and better him controlling the industry that's amazing that they can literally just say them by black people. America no more they going to europe is easier easier to import the drug ramsay making way more money and you get less time i when i was locked up in your you know i'm saying for that b******* i was like like it was gas in the cell that was there on drug offenses and how much you get called for four keys i'm like damn. Woman three women want you're not really hurting them. Start trying to catch new episodes of the joe rogan experience for free only on spotify watch back catalogue jre videos on spotify including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=tlHbnW1KmQc"
    },
    "Tim Dillon's AirBnB Saga": {
        "text": "The joe rogan experience i was thrown off air b&b this is a fact you did not support me on that you do not use said he should have done the dishes this was yours was joe a $450 cleaning fee. Horribly designed house and they should have maybe at the gay guy or someone to fix it but as a gay guy would have you done what would you have done rather to fix it all the furniture when you couldn't sit in it was like art pieces. And i had a dog like that you don't like dogs that they have like a weird weimaraner i just knew who they were i knew they could see the photo when i hate that fat conservative f*** or whatever even though i'm really in the middle politically and even wait what but they got mad at me and they got me off airbnb because i discussed this on my podcast and it colorful matter. If we say something on it got it got back to them one of their minions told them and they were personal they asked me to give him a good review which you're not allowed to do in the air b&b process right before roads review that i've never given anyone a bad review on airbnb i don't do it i'm not a rag they text me and said hey lol. So weird i mean aren't fireplaces supposed to be on the ground floor why is it is there really a house is really far behind are culturally appropriating native american it's just the whole thing makes me sick can you don't know they are not because i've seen them. Take a percocet at your office okay. everything has to be a journey to hyperspace not everything but something's sure i just am a fan of pill has a coquette i like people that are productive but you in joshua tree that's the place we psychedelic people go and i used to do a sin go to a bar like a person and i would cost if i did dmt i would go and give you all the information you know i would have brought them. Human beings are apartment. I don't believe in baxter chairs because i have good posture because i said i left for dishes and these people treated treated me. Whatever nobody broke anything you know you should do what you can't do anymore cuz you're not nice airbnb anymore but you should just make a video of you leaving the house and then no one can say s*** and that's where i would go and use to travel and not to hotel zone. The whole thing is nice little pool to beautiful view. those people are enjoying it why can't you enjoy it. Because i don't know what you're doing i might come in at a high octane war with a few desert lesbian she doesn't fit to desert dikes or got it for me and i'm going to f****** keep i'm going to ride it till the wheels go off at my lawyer's like a man what are you doing so. Other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=zhrcrySeRuo"
    },
    "The FBI Investigating Governor Cuomo Over Nursing Home Deaths": {
        "text": "The joe rogan experience democrat who's not funny and should be in jail but not to the guy he's explaining what they almost had him but basically said i will destroy you yeah which is like they they were they said. Now and then they look terrible when they get caught that's the least of it that he looks terrible the reason why he doesn't want them to say things is because they lied about the covid-19 and nursing home the cove odesza nursing homes which are directly attributable to his policies killed literally they lied about 50% wow. But i was reading about the potential fbi investigation is a criminal investigation while there should be what he's one of his aides leak the fact that they were worried that these numbers were going to get out and that it was going to help the trump administration so they have this is all crazy i don't really know what the f*** i'm talking about i'm listening to people at crystal and soccer that are from the hill from rise nbc you know they're f***** cuz this is a democrat writer covering. Wants to interview him i believe is jake tapper i think it was a credible journalist right and doesn't talk to jake tapper jake tapper. What i'm talking about with my friend right is brilliant guy was dealing with social media pressure that just you taking too much criticism it starts to change your perspective which starts to change your behavior which becomes ultimately very detrimental and you see it with cuomo when he starts saying one of the things that he said about like lockdowns he's like you know if you didn't want to gain weight you shouldn't eat the cheesecake and they get sick and it's more likely than if you let them do things and just f****** go out in public and just yeah. Go places and mailed it was also a guy that when new york was descending into a crime infested hellscape he said everybody come back i'll cook for you i'll cook for each other with metal bats industries. Depart of ever going to do that we're going to really bring back the heart and soul new york city we need arts and culture back and we need people to see it and feel it to participate in it to know that that essence of new york city has not been defeated by the coronavirus but we'll come back strong until they allowed giant where was the guy with the bat for that catch new episodes for free only on spotify watch back catalogue jre videos on spotify including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre. In the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=RzmgUCIEwbs"
    },
    "The Austin Ice Storm & Ted Cruz Traveling to Cancun During Crisis": {
        "text": "The joe rogan experience i mean we considered suing you i was hitting a dog can i take legal action against him like i told the lawyer and apparently i cannot give you free meals yeah every time we go out forever we were i mean i was on a bread line two days ago my open or flies into town we're going to fly out for shows all the flights grounded but can't go anywhere i mean we're waiting outside of a supermarket for an hour and then we're eating fish sticks in the dark of my house with no power and i'm like you know joe f****** rugged man this was a real f****** leap of faith but it's looking better today it'll be fine once in a year but i think what that means is like ever recorded like you go back to 18.. F****** instruments are they yeah what would they say driving down fast food wasn't open nothing was open you know what was open the houston airport my boy ted cruz is like. Like that's pretty sad but what can he do what is your what is the reason for him staying that well i think it's just the optics of how it looks of course no he doesn't have any i don't think he has any power to do anything good maybe he should be there with blanket. About it i mean it's crazy to watch it's all so crazy that he got caught and then he came back well he said i was always coming back i was being a good father to put a spin on it could ted cruz's the face of the guy that always has caught like he looks like the kid in school who gets in on the prank too late and then the teacher catches them like he just looks like he gets caught he's not he's not one of those guys who gets away with it no matter what happened the video where he was running for president and he sat down with his mom. The whole thing's a nightmare about somebody from the wife's group text leaked they were inviting neighbors going to come to f******, or whatever the hell come to cancun and somebody leaked it to the new york times going to use the group text proving they were inviting us all i wonder how many moms were in the situation where where he was f*** i don't remember god damn it we talked about it on the podcast jamie remember what it was where he was calling them out for. Garlic is escaping me platforming people or privacy yes it was including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is app. Solutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=Z8WAMGe8x3M"
    },
    "Cody Garbrandt's COVID Battle": {
        "text": "The joe rogan experience is my first time after the sun sail fight since the cabins are occupied i didn't get injured right or tendons and ligaments and stem cells out for 8 weeks do you know and my recovery scored 1% in the morning. Head injury latin by my doctor i went and saw he's i got to catch him like dude i didn't get hit hard and sparring my fights like i worked on defense a lot like i know i would know if it was a concussive blow that gave me vertigo and what did you experience it after training to to experience it was during grappling i was like you didn't like whiteheads. Felt something was off with your body besides water to go my body felt like i just was throughout a three-week period when i was training and i didn't feel like myself at all and just mental clarity was so do you think during that time you had called the whole time i think so you know that is crazy because you never gave your body a break and you were beating yourself up while you were fighting off kovis well that i think what happened was a kidney infection in the beginning of 2020 i was on all of the antibiotics i was not fired if antibiotics cause 2 weeks before the fight with a son so that section came back so i had to go to another infectious disease doctor that my doctor hill found in sacramento this lady was amazing did to blood cultures found out that all the report from the hospital in jersey the reports from the specialist in the cleveland study those all in a day i got a blood culture i was on the wrong antibiotics didn't kill the infection is paisley put a band-aid over it so i could go ten days to iv infusion center to get. Iv antibiotics 10-day of oral antibiotics for 5 months almost from jersey i was on 5 different antibiotics from the hospital from the how many days did you have when you weren't on antibiotics before the fight and i declare that i had and i was on antibiotics i'll be up to the fight. Immune system up while you had covid-19 because of that you got covid-19 wiebad yes. so tell me what it was like i was horrible i mean i had that vertigo was the first episode and then when did they test you for i didn't get test at i went down to mike tyson's ranch we're working with us markups company whilst monster mom doing digital videos and it was our first kind of getting a piece together cuz they start doing fighters boxers and some rest though w kurt angle is there so i do like rabbit test but we just did here and waited waited while another one. I got an inhaler side pneumonia pneumonia vertigo and then i didn't like a 21-day cuz i had it so backed up getting tested like every 3 weeks. But because you were training while you had it and beating yourself up it just got deep into you i mean it it it took over my body but i think honestly from the kidney infection be on an antibiotic system was so weak out of the hospital and i did a press conference about having to fight my kidney levels are good and waiting for maybe have to do a biopsy i want to fight at work on i was like begging shawnee from where i was at getting ready to fight us until the first time in march do i literally had to start walking on a treadmill for a couple weeks to get my i was in rough shape rough shape and starch any of my business partners house at home jenkins everything is closed already. Open city i got a treadmill i got wade's kettlebells and ionic covalent and so whenever they're just started the train i might have to get myself ready and it was brutal brutal brutal training getting back in their notices preco kind of injections and i felt really good i actually had to go. Do arizona the mayo clinic dana thought i had meniere's disease i went saw his doctor that did his surgery to give a shot in his ears did all these testing his hearing test where they take lots of hearing in this year and they don't know why i think maybe because i'm this is my lead lead and you get hit in the left ear a lot at so i can say. That's the most common one you know a lot of people just to know they can stay strong or do something sleep wrong they're not going to have vertigo and there's a maneuver you do to put it back but it wasn't positional vertigo i just literally covid-19 had me so messed up so you were just basically getting your your health back which is crazy that you beat assuncao in that state to be clearly compromised if you like for me like i like we talked about earlier with a tgi fridays i don't have to go in there be angry and upset and their hate this guy of hatred for this guy it's a flip the switch like when you know you have it anymore you don't. Read me i've have it sized needs to get in their house is not taking no for an answer and my coaches and stuff like how i don't know if you're going to make it you know and coach mark i call him cuz we basically did i would feel my pad work and my sparring rounds and send it to a coach on whatsapp and that he would break everything down do more this to less of that looking good-looking fast on you know your leftover counter off and things like that virtually you know cup camp through there so then when it came out to ask at work in the codes to and i'll keep working your codes keep working to make sure you're doing under nine things like that then we came to fight week which is free of it. Free free of it it was literally if you know a couple months of having a testing into a my daughter's i'm not going to send out anymore atascadero 72-hour turn once and every time you did that you had it every time i text my son he didn't have it in there for people you know. There's also you you got to be you got to be able to take a step back and go it's not wise to push sometimes and i think i see if i got tested before having covid-19 before copperhead the first i've had this probably never got it. we would have had it for a couple of weeks or whatever and that yak. I got to call dan and tell him like a i store my bicep then get the mri get that mri nothing's torn it was a guy that i had to go get a urgent ultrasound i tore my vein in half and it ripped in half and then i had three blood clots so i was immediately they start injecting me with blood thinners i was on you know since. 3 months catch new episodes of the joe rogan experience for free only on spotify back catalogue jre videos on spotify including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=su5iiYGLZLM"
    },
    "Cody Garbrandt Looks Back on TJ Dillashaw Fights": {
        "text": "The joe rogan experience a lot of my losses i would load up right and put my head first and then like more emotionally invested in those fights than any fight you've ever had right definitely and that's not me i don't have to go i love the fight i can fight in your studio right now. What is different i think that i remove myself after winning the world title i'd i didn't feel like it was everything that i thought i was going to be in what we're just the whole prolific your world champion you're the best in the world you know i didn't i never expect a lot of things that were happened but i just spoke to the doctor through the journey of getting to where i was at looking back on and i was like man like and what's next i didn't have the what's next. Are you reaching this goes what are you working towards are you reading health books self-help books are you reading you know book to help your your mental fortitude to strengthen that you know are you doing yoga are you doing other so much and resource against the main thing i wasn't do that i feel like i was just going through the motions and there's a lot of other things there's a lot of things that inspire but i'm slowly putting the blame on myself because that's how i react to things and i wasn't the person that i am during those kinds of no tribulations and trials in my life i've gone from the house 24 25 years old i'm 29 years old now and i look at the game differently. Jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=P6BchqCbHdM"
    },
    "Cody Garbrandt's Comeback": {
        "text": "The joe rogan experience first wok congratulations on your comeback i that you know you're a great guy and when there's someone i like who loses a bunch of fights in a row and you get into this kid it's hot it's hard to watch i can't imagine what it's like being you you know they have a young child and to be dealing with all this going on i mean it's like losing your tablet then to come back the way you did against a really f****** tough guy in the sun's out and get arguably the ko the year i mean you got to be feeling pretty f****** good i feel great you know i'm on top of the world champion fights kid honestly it feels like a lifetime ago i feel like i'm just a different person when i was at from there you know it removed and. Just doing differently thinking differently you know how he's able to approach the game pick myself back up time and time again i mean it is a horrible place to get knocked out on how to get back there and really it wasn't nothing that i needed to learn do i didn't have to reinvent the wheel it was doing. Play legendary like getting out of your comfort zone like you're doing your sauna sessions like you're pushing yourself to go in there and then just be uncomfortable you know if i had to go out there and with that come back and i moved to jersey the training camp out there i supposed to talk to you about that we have off about 50 things that were working on before camping. Just basically white paper and you know it was nice to get that kind of frankie's done and had success over the years so we met together he got to know me really well and we worked you know extensively with ricardo almeida up there as well but yeah coach henry is just there's nothing but what i loved about him was the first thing he said to me was it his job is to our family. Wrestle all day during jiu-jitsu 9 to get tapped on it happening but i was safe but i didn't put myself in those positions when the fight really happens you have to see how you know your grit you going to be able to fight off the hand so i have to buy a triangle fight all those bad position so you're comfortable or whatever to fight goes and i feel like that's where i'm at now i've transitioned into that but i was so green when i got down from there and then a lot of my speed and power can't afford me to the top where i can have to kind of drawback little bit and do the correctional airs not reinventing not do things but the defense of part of things that you know i wasn't raining in jersey and i knew i had the good side slips and movements but some of the slips coach was watching maui get caught on the not the first or second 1/4 punch. Solid working with them and just consoling and chris has the same way of my coaches on aphmau are the same with hands up hands up hands up i was at that point in my life i was just so aggressive and angry and i just don't feel like going to work like defensive least now he's a great fighter in that respect keep doing these things they will work on fading this guy dude i'm saying i'm saying he's not really but you're not really coming in but i kept on the fan so we started catching some shots and i saw in his eyes were hurting them and then fainted did the tyson to an overhand right drop them and i knew i had that range and the power and speed in his timing that he would come in with something so. Drake the first round i can't have myself to the cajun coach and he if i kick my ass being on the cage like get got the kids get to the you know movement more where movement fighters you know how you made me and i know i back sons cage but i saw and it in the round was ending but i saw a son till i call here's my opening and then he chased me down and distance was there he was come with a kick after i can lean back. How to feel so good catch new episodes of the joe rogan experience for free only on spotify watch back catalogue jre videos on spotify including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jre on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=G5UwqmZ_LYI"
    },
    "Elon Musk on \"Shocking\" Moment He Broke Window on Cybertruck": {
        "text": "The joe rogan experience have you ever considered something alternative to air inflated tires have you seen tammy's is alternatives that have essentially spaces in between the upper wall on the wheel have you thought about that we haven't found you know that you got to take out plot holes and bumps have low rolling-resistance so that the good range there's a lot of things to try to put into one tire and if you also say and if can't have are like this is hard so weird. I don't think it won't be such a thing i think it will be too precise cuz it seems like we've just gotten way too comfortable the side do the tires blow out and you get flats is very annoying lesser-known very annoying. I know that pothole can pay the fix up i mean fix that pothole seems like. We literally spent you know hours beforehand would like lots of people throwing steel balls at the window at least at least a dozen people. The base of it and once cracked the base of it lose all the strength and then just have a hairline fracture and then they need do you get he headed anywhere can shatter glass. Now why did you decide to do all that make it bulletproof and make it like you can hit it with a sledgehammer like what was the motivation to make it different than just like a model s. I mean you could possibly put the the cover of the truck bed air put some solar salesman at so i can just leave it out in the sun you know probably bring you recharge a few miles a day type of thing but was only a few months but what about one day is it possible to technology could have evolved to the point where they can go to the sun so you don't like your you know that's right angle so so. Catch new episodes of the joe rogan experience for free only on spotify watch back catalogue jre videos on spotify including clips easily seamlessly switch between video and audio experience on spotify you can listen to the jre in the background while using other apps and can download episodes to save on data cost all for free spotify is absolutely free you don't have to have a premium account to watch new jre episodes you just need to search for the jerry on your spotify app go to spotify now to get this full episode of the joe rogan experience. ",
        "url": "https://www.youtube.com/watch?v=RCD-vXumMIs"
    }
}